-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 09 2021 г., 19:07
-- Версия сервера: 10.3.13-MariaDB
-- Версия PHP: 7.3.2

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `rasteniya`
--

-- --------------------------------------------------------

--
-- Структура таблицы `article`
--

CREATE TABLE `article` (
  `id` int(11) NOT NULL,
  `name` varchar(254) NOT NULL,
  `description` varchar(254) DEFAULT NULL,
  `text` text NOT NULL,
  `slug` varchar(254) NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL,
  `updated_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `article`
--

INSERT INTO `article` (`id`, `name`, `description`, `text`, `slug`, `created_at`, `updated_at`) VALUES
(1, 'asdgh', 'agesdhfgjhjk.hgyfthd', 'esgdrhftjygukhi,jgmnbfvdsrtfhyjt r tbvg ethnymutynrheh tjntrhetymutyrdg htytrherght nrgtn rer ', 'asdf', 1234521345, 3245767);

-- --------------------------------------------------------

--
-- Структура таблицы `cart_items`
--

CREATE TABLE `cart_items` (
  `user_id` int(11) UNSIGNED NOT NULL,
  `product_id` int(11) UNSIGNED NOT NULL,
  `quantity` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `category`
--

CREATE TABLE `category` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(254) NOT NULL,
  `slug` varchar(254) NOT NULL,
  `parent_id` int(10) UNSIGNED DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `category`
--

INSERT INTO `category` (`id`, `name`, `slug`, `parent_id`) VALUES
(1, 'efsgrd', '', 0),
(2, 'Лиственные деревья', 'listvennye-dereva', 0),
(3, 'бархат', 'barhat', 2),
(4, 'Лиственные кустарники', 'listvennye-kustarniki', 0),
(5, 'барбарис', 'barbaris', 4),
(6, 'бирючина', 'birucina', 4),
(7, 'виноград', 'vinograd', 4),
(8, 'гортензия', 'gortenzia', 4),
(9, 'дуб', 'dub', 2),
(10, 'жимолость', 'zimolost', 4),
(11, 'ива', 'iva', 2),
(12, 'Кактусы садовые', 'kaktusy-sadovye', 0),
(13, 'опунция', 'opuncia', 12),
(14, 'катальпа', 'katalpa', 2),
(15, 'каштан', 'kastan', 2),
(16, 'кизильник', 'kizilnik', 4),
(17, 'Хвойные кустарники', 'hvojnye-kustarniki', 0),
(18, 'можжевельник', 'mozzevelnik', 17),
(19, 'Плодовые растения', 'plodovye-rastenia', 0),
(20, 'орех', 'oreh', 19),
(21, 'персик', 'persik', 19),
(22, 'спирея', 'spirea', 4),
(23, 'сумах', 'sumah', 2),
(24, 'самшит', 'samsit', 2),
(25, 'яблоня', 'ablona', 19);

-- --------------------------------------------------------

--
-- Структура таблицы `city`
--

CREATE TABLE `city` (
  `id` int(11) NOT NULL,
  `name` varchar(254) NOT NULL,
  `slug` varchar(254) NOT NULL,
  `region` varchar(254) NOT NULL,
  `district` varchar(254) NOT NULL,
  `lat` double NOT NULL,
  `lng` double NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `city`
--

INSERT INTO `city` (`id`, `name`, `slug`, `region`, `district`, `lat`, `lng`) VALUES
(2, 'Абаза', 'abaza', 'Хакасия', 'Сибирский', 52.651657, 90.088572),
(3, 'Абакан', 'abakan', 'Хакасия', 'Сибирский', 53.721152, 91.442387),
(4, 'Абдулино', 'abdulino', 'Оренбургская область', 'Приволжский', 53.677839, 53.647263),
(5, 'Абинск', 'abinsk', 'Краснодарский край', 'Южный', 44.866256, 38.151163),
(6, 'Агидель', 'agidel', 'Башкортостан', 'Приволжский', 55.899835, 53.92204),
(7, 'Агрыз', 'agryz', 'Татарстан', 'Приволжский', 56.526318, 52.995266),
(8, 'Адыгейск', 'adygejsk', 'Адыгея', 'Южный', 44.884856, 39.190567),
(9, 'Азнакаево', 'aznakaevo', 'Татарстан', 'Приволжский', 54.859808, 53.074533),
(10, 'Азов', 'azov', 'Ростовская область', 'Южный', 47.112442, 39.423581),
(11, 'Ак-Довурак', 'ak-dovurak', 'Тыва', 'Сибирский', 51.178493, 90.598474),
(12, 'Аксай', 'aksaj', 'Ростовская область', 'Южный', 47.269804, 39.862615),
(13, 'Алагир', 'alagir', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.041711, 44.219875),
(14, 'Алапаевск', 'alapaevsk', 'Свердловская область', 'Уральский', 57.853038, 61.702672),
(15, 'Алатырь', 'alatyr', 'Чувашия', 'Приволжский', 54.839816, 46.572195),
(16, 'Алдан', 'aldan', 'Якутия', 'Дальневосточный', 58.609451, 125.381673),
(17, 'Алейск', 'alejsk', 'Алтайский край', 'Сибирский', 52.492167, 82.779448),
(18, 'Александров', 'aleksandrov', 'Владимирская область', 'Центральный', 56.397774, 38.727621),
(19, 'Александровск', 'aleksandrovsk', 'Пермский край', 'Приволжский', 59.162925, 57.584669),
(20, 'Александровск-Сахалинский', 'aleksandrovsk-sahalinskij', 'Сахалинская область', 'Дальневосточный', 50.894564, 142.1594),
(21, 'Алексеевка', 'alekseevka', 'Белгородская область', 'Центральный', 50.629961, 38.688095),
(22, '<span id=\"pastemarkerend\">&nbsp;</span>Алексин', 'span-id-pastemarkerendnbspspanaleksin', 'Тульская область', 'Центральный', 54.502429, 37.066034),
(23, 'Алзамай', 'alzamaj', 'Иркутская область', 'Сибирский', 55.555072, 98.664357),
(24, 'Альметьевск', 'almetevsk', 'Татарстан', 'Приволжский', 54.901383, 52.297113),
(25, 'Амурск', 'amursk', 'Хабаровский край', 'Дальневосточный', 50.226797, 136.910607),
(26, 'Анадырь', 'anadyr', 'Чукотский АО', 'Дальневосточный', 64.733115, 177.508924),
(27, 'Анапа', 'anapa', 'Краснодарский край', 'Южный', 44.894965, 37.31617),
(28, 'Ангарск', 'angarsk', 'Иркутская область', 'Сибирский', 52.544358, 103.88824),
(29, 'Андреаполь', 'andreapol', 'Тверская область', 'Центральный', 56.65079, 32.262023),
(30, 'Анжеро-Судженск', 'anzero-sudzensk', 'Кемеровская область', 'Сибирский', 56.083175, 86.018216),
(31, 'Анива', 'aniva', 'Сахалинская область', 'Дальневосточный', 46.713168, 142.526595),
(32, 'Апатиты', 'apatity', 'Мурманская область', 'Северо-Западный', 67.568041, 33.407115),
(33, 'Апрелевка', 'aprelevka', 'Московская область', 'Центральный', 55.545166, 37.07322),
(34, 'Апшеронск', 'apseronsk', 'Краснодарский край', 'Южный', 44.468327, 39.736707),
(35, 'Аргун', 'argun', 'Чечня', 'Северо-Кавказский', 56.694538, 60.834315),
(36, 'Ардатов', 'ardatov', 'Мордовия', 'Приволжский', 54.84656, 46.241183),
(37, 'Ардон', 'ardon', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.175598, 44.295621),
(38, 'Арзамас', 'arzamas', 'Нижегородская область', 'Приволжский', 55.386666, 43.815687),
(39, 'Аркадак', 'arkadak', 'Саратовская область', 'Приволжский', 51.938814, 43.499849),
(40, 'Армавир', 'armavir', 'Краснодарский край', 'Южный', 44.997655, 41.129644),
(41, 'Арсеньев', 'arsenev', 'Приморский край', 'Дальневосточный', 44.162084, 133.269726),
(42, 'Арск', 'arsk', 'Татарстан', 'Приволжский', 56.091311, 49.876989),
(43, 'Артём', 'artem', 'Приморский край', 'Дальневосточный', 43.354804, 132.18563),
(44, 'Артёмовск', 'artemovsk', 'Красноярский край', 'Сибирский', 54.347336, 93.435749),
(45, 'Артёмовский', 'artemovskij', 'Свердловская область', 'Уральский', 57.338402, 61.894651),
(46, 'Архангельск', 'arhangelsk', 'Архангельская область', 'Северо-Западный', 64.539393, 40.516939),
(47, 'Асбест', 'asbest', 'Свердловская область', 'Уральский', 57.005274, 61.458114),
(48, 'Асино', 'asino', 'Томская область', 'Сибирский', 56.997514, 86.153906),
(49, 'Астрахань', 'astrahan', 'Астраханская область', 'Южный', 46.347869, 48.033574),
(50, 'Аткарск', 'atkarsk', 'Саратовская область', 'Приволжский', 51.873632, 45.000296),
(51, 'Ахтубинск', 'ahtubinsk', 'Астраханская область', 'Южный', 48.284884, 46.164413),
(52, 'Ачинск', 'acinsk', 'Красноярский край', 'Сибирский', 56.269496, 90.495231),
(53, 'Аша', 'asa', 'Челябинская область', 'Уральский', 54.990628, 57.278469),
(54, 'Бабаево', 'babaevo', 'Вологодская область', 'Северо-Западный', 59.389227, 35.937759),
(55, 'Бабушкин', 'babuskin', 'Бурятия', 'Сибирский', 51.715833, 105.864363),
(56, 'Бавлы', 'bavly', 'Татарстан', 'Приволжский', 54.406333, 53.245896),
(57, 'Багратионовск', 'bagrationovsk', 'Калининградская область', 'Северо-Западный', 54.386509, 20.639638),
(58, 'Байкальск', 'bajkalsk', 'Иркутская область', 'Сибирский', 51.522821, 104.149928),
(59, 'Баймак', 'bajmak', 'Башкортостан', 'Приволжский', 52.591257, 58.311199),
(60, 'Бакал', 'bakal', 'Челябинская область', 'Уральский', 54.938064, 58.809171),
(61, 'Баксан', 'baksan', 'Кабардино-Балкария', 'Северо-Кавказский', 43.681939, 43.534613),
(62, 'Балабаново', 'balabanovo', 'Калужская область', 'Центральный', 55.177396, 36.65677),
(63, 'Балаково', 'balakovo', 'Саратовская область', 'Приволжский', 52.018424, 47.819667),
(64, 'Балахна', 'balahna', 'Нижегородская область', 'Приволжский', 56.504556, 43.602005),
(65, 'Балашиха', 'balasiha', 'Московская область', 'Центральный', 55.796339, 37.938199),
(66, 'Балашов', 'balasov', 'Саратовская область', 'Приволжский', 51.554601, 43.146469),
(67, 'Балей', 'balej', 'Забайкальский край', 'Сибирский', 51.582284, 116.637948),
(68, 'Балтийск', 'baltijsk', 'Калининградская область', 'Северо-Западный', 54.644072, 19.892177),
(69, 'Барабинск', 'barabinsk', 'Новосибирская область', 'Сибирский', 55.350412, 78.341923),
(70, 'Барнаул', 'barnaul', 'Алтайский край', 'Сибирский', 53.346785, 83.776856),
(71, 'Барыш', 'barys', 'Ульяновская область', 'Приволжский', 53.653468, 47.118029),
(72, 'Батайск', 'batajsk', 'Ростовская область', 'Южный', 47.138333, 39.744469),
(73, 'БахчисарайОспаривается', 'bahcisarajosparivaetsa', 'Крым', 'Южный', 44.754887, 33.85214),
(74, 'Бежецк', 'bezeck', 'Тверская область', 'Центральный', 57.78567, 36.693871),
(75, 'БелаяКалитва', 'belaakalitva', 'Ростовская область', 'Южный', 57.78567, 36.693871),
(76, 'БелаяХолуница', 'belaaholunica', 'Кировская область', 'Приволжский', 57.78567, 36.693871),
(77, 'Белгород', 'belgorod', 'Белгородская область', 'Центральный', 50.59566, 36.587223),
(78, 'Белебей', 'belebej', 'Башкортостан', 'Приволжский', 54.103441, 54.111279),
(79, 'Белёв', 'belev', 'Тульская область', 'Центральный', 53.809934, 36.130097),
(80, 'Белинский', 'belinskij', 'Пензенская область', 'Приволжский', 52.96562, 43.408679),
(81, 'Белово', 'belovo', 'Кемеровская область', 'Сибирский', 54.422114, 86.303692),
(82, 'Белогорск', 'belogorsk', 'Амурская область', 'Дальневосточный', 50.921287, 128.473917),
(83, 'Белозерск', 'belozersk', 'Вологодская область', 'Северо-Западный', 60.030843, 37.789016),
(84, 'Белокуриха', 'belokuriha', 'Алтайский край', 'Сибирский', 51.99606, 84.984004),
(85, 'Беломорск', 'belomorsk', 'Карелия', 'Северо-Западный', 64.53032, 34.763328),
(86, 'Белорецк', 'beloreck', 'Башкортостан', 'Приволжский', 53.967621, 58.410023),
(87, 'Белореченск', 'belorecensk', 'Краснодарский край', 'Южный', 44.761141, 39.87114),
(88, 'Белоусово', 'belousovo', 'Калужская область', 'Центральный', 55.089516, 36.657812),
(89, 'Белоярский', 'beloarskij', 'Ханты-Мансийский АО — Югра', 'Уральский', 63.716043, 66.667588),
(90, 'Белый', 'belyj', 'Тверская область', 'Центральный', 55.83385, 32.938805),
(91, 'Бердск', 'berdsk', 'Новосибирская область', 'Сибирский', 54.758288, 83.107135),
(92, 'Березники', 'berezniki', 'Пермский край', 'Приволжский', 59.407922, 56.804015),
(93, 'Берёзовский', 'berezovskij', 'Кемеровская область', 'Сибирский', 56.910173, 60.798203),
(94, 'Берёзовский', 'berezovskij', 'Свердловская область', 'Уральский', 56.910173, 60.798203),
(95, 'Беслан', 'beslan', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.19376, 44.533792),
(96, 'Бийск', 'bijsk', 'Алтайский край', 'Сибирский', 52.539297, 85.21382),
(97, 'Бикин', 'bikin', 'Хабаровский край', 'Дальневосточный', 46.818592, 134.255034),
(98, 'Билибино', 'bilibino', 'Чукотский АО', 'Дальневосточный', 68.057129, 166.451139),
(99, 'Биробиджан', 'birobidzan', 'Еврейская АО', 'Дальневосточный', 48.794668, 132.921754),
(100, 'Бирск', 'birsk', 'Башкортостан', 'Приволжский', 55.417531, 55.530707),
(101, 'Бирюсинск', 'birusinsk', 'Иркутская область', 'Сибирский', 55.960876, 97.820453),
(102, 'Бирюч', 'biruc', 'Белгородская область', 'Центральный', 50.648389, 38.400553),
(103, 'Благовещенск', 'blagovesensk', 'Башкортостан', 'Приволжский', 50.28702, 127.541025),
(104, 'Благовещенск', 'blagovesensk', 'Амурская область', 'Дальневосточный', 50.28702, 127.541025),
(105, 'Благодарный', 'blagodarnyj', 'Ставропольский край', 'Северо-Кавказский', 45.095649, 43.440021),
(106, 'Бобров', 'bobrov', 'Воронежская область', 'Центральный', 51.097718, 40.035604),
(107, 'Богданович', 'bogdanovic', 'Свердловская область', 'Уральский', 56.776502, 62.046295),
(108, 'Богородицк', 'bogorodick', 'Тульская область', 'Центральный', 53.770694, 38.131687),
(109, 'Богородск', 'bogorodsk', 'Нижегородская область', 'Приволжский', 56.103362, 43.516755),
(110, 'Боготол', 'bogotol', 'Красноярский край', 'Сибирский', 56.210117, 89.531258),
(111, 'Богучар', 'bogucar', 'Воронежская область', 'Центральный', 49.935512, 40.559079),
(112, 'Бокситогорск', 'boksitogorsk', 'Ленинградская область', 'Северо-Западный', 59.473572, 33.847675),
(113, 'Болгар', 'bolgar', 'Татарстан', 'Приволжский', 57.852118, 114.198968),
(114, 'Бологое', 'bologoe', 'Тверская область', 'Центральный', 57.885626, 34.053776),
(115, 'Болотное', 'bolotnoe', 'Новосибирская область', 'Сибирский', 55.672001, 84.385447),
(116, 'Болохово', 'bolohovo', 'Тульская область', 'Центральный', 54.082107, 37.82679),
(117, 'Болхов', 'bolhov', 'Орловская область', 'Центральный', 53.443097, 36.005087),
(118, 'БольшойКамень', 'bolsojkamen', 'Приморский край', 'Дальневосточный', 53.443097, 36.005087),
(119, 'Бор', 'bor', 'Нижегородская область', 'Приволжский', 56.356517, 44.064575),
(120, 'Борзя', 'borza', 'Забайкальский край', 'Сибирский', 50.387629, 116.523485),
(121, 'Борисоглебск', 'borisoglebsk', 'Воронежская область', 'Центральный', 51.367725, 42.074977),
(122, 'Боровичи', 'borovici', 'Новгородская область', 'Северо-Западный', 58.388219, 33.914025),
(123, 'Боровск', 'borovsk', 'Калужская область', 'Центральный', 55.207634, 36.483584),
(124, 'Бородино', 'borodino', 'Красноярский край', 'Сибирский', 55.905442, 94.902177),
(125, 'Братск', 'bratsk', 'Иркутская область', 'Сибирский', 56.151362, 101.63408),
(126, 'Бронницы', 'bronnicy', 'Московская область', 'Центральный', 55.425471, 38.264108),
(127, 'Брянск', 'bransk', 'Брянская область', 'Центральный', 53.243562, 34.363443),
(128, 'Бугульма', 'bugulma', 'Татарстан', 'Приволжский', 54.536413, 52.789489),
(129, 'Бугуруслан', 'buguruslan', 'Оренбургская область', 'Приволжский', 53.6523, 52.432606),
(130, 'Будённовск', 'budennovsk', 'Ставропольский край', 'Северо-Кавказский', 44.781528, 44.165024),
(131, 'Бузулук', 'buzuluk', 'Оренбургская область', 'Приволжский', 52.788116, 52.262438),
(132, 'Буинск', 'buinsk', 'Татарстан', 'Приволжский', 54.964153, 48.290142),
(133, 'Буй', 'buj', 'Костромская область', 'Центральный', 58.481719, 41.533113),
(134, 'Буйнакск', 'bujnaksk', 'Дагестан', 'Северо-Кавказский', 42.821749, 47.115927),
(135, 'Бутурлиновка', 'buturlinovka', 'Воронежская область', 'Центральный', 50.835367, 40.584825),
(136, 'Валдай', 'valdaj', 'Новгородская область', 'Северо-Западный', 57.980199, 33.246667),
(137, 'Валуйки', 'valujki', 'Белгородская область', 'Центральный', 50.211194, 38.099914),
(138, 'Велиж', 'veliz', 'Смоленская область', 'Центральный', 55.603969, 31.197214),
(139, 'ВеликиеЛуки', 'velikieluki', 'Псковская область', 'Северо-Западный', 55.603969, 31.197214),
(140, 'ВеликийНовгород', 'velikijnovgorod', 'Новгородская область', 'Северо-Западный', 55.603969, 31.197214),
(141, 'ВеликийУстюг', 'velikijustug', 'Вологодская область', 'Северо-Западный', 55.603969, 31.197214),
(142, 'Вельск', 'velsk', 'Архангельская область', 'Северо-Западный', 61.065915, 42.10331),
(143, 'Венёв', 'venev', 'Тульская область', 'Центральный', 54.350369, 38.265527),
(144, 'Верещагино', 'veresagino', 'Пермский край', 'Приволжский', 58.079761, 54.658083),
(145, 'Верея', 'verea', 'Московская область', 'Центральный', 55.343369, 36.185694),
(146, 'Верхнеуральск', 'verhneuralsk', 'Челябинская область', 'Уральский', 53.876143, 59.216953),
(147, 'ВерхнийТагил', 'verhnijtagil', 'Свердловская область', 'Уральский', 53.876143, 59.216953),
(148, 'ВерхнийУфалей', 'verhnijufalej', 'Челябинская область', 'Уральский', 53.876143, 59.216953),
(149, 'ВерхняяПышма', 'verhnaapysma', 'Свердловская область', 'Уральский', 53.876143, 59.216953),
(150, 'ВерхняяСалда', 'verhnaasalda', 'Свердловская область', 'Уральский', 53.876143, 59.216953),
(151, 'ВерхняяТура', 'verhnaatura', 'Свердловская область', 'Уральский', 53.876143, 59.216953),
(152, 'Верхотурье', 'verhoture', 'Свердловская область', 'Уральский', 58.862216, 60.810213),
(153, 'Верхоянск', 'verhoansk', 'Якутия', 'Дальневосточный', 67.550161, 133.390702),
(154, 'Весьегонск', 'vesegonsk', 'Тверская область', 'Центральный', 58.658355, 37.259019),
(155, 'Ветлуга', 'vetluga', 'Нижегородская область', 'Приволжский', 57.852885, 45.776099),
(156, 'Видное', 'vidnoe', 'Московская область', 'Центральный', 55.557174, 37.708644),
(157, 'Вилюйск', 'vilujsk', 'Якутия', 'Дальневосточный', 63.751722, 121.627326),
(158, 'Вилючинск', 'vilucinsk', 'Камчатский край', 'Дальневосточный', 52.906857, 158.418296),
(159, 'Вихоревка', 'vihorevka', 'Иркутская область', 'Сибирский', 56.120718, 101.170396),
(160, 'Вичуга', 'vicuga', 'Ивановская область', 'Центральный', 57.217138, 41.918149),
(161, 'Владивосток', 'vladivostok', 'Приморский край', 'Дальневосточный', 43.115536, 131.885485),
(162, 'Владикавказ', 'vladikavkaz', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.02115, 44.68196),
(163, 'Владимир', 'vladimir', 'Владимирская область', 'Центральный', 56.129057, 40.406635),
(164, 'Волгоград', 'volgograd', 'Волгоградская область', 'Южный', 48.707073, 44.51693),
(165, 'Волгодонск', 'volgodonsk', 'Ростовская область', 'Южный', 47.516545, 42.198423),
(166, 'Волгореченск', 'volgorecensk', 'Костромская область', 'Центральный', 57.439464, 41.157456),
(167, 'Волжск', 'volzsk', 'Марий Эл', 'Приволжский', 55.862267, 48.372041),
(168, 'Волжский', 'volzskij', 'Волгоградская область', 'Южный', 56.053804, 48.555271),
(169, 'Вологда', 'vologda', 'Вологодская область', 'Северо-Западный', 59.220496, 39.891523),
(170, 'Володарск', 'volodarsk', 'Нижегородская область', 'Приволжский', 56.21695, 43.159729),
(171, 'Волоколамск', 'volokolamsk', 'Московская область', 'Центральный', 56.035728, 35.958537),
(172, 'Волосово', 'volosovo', 'Ленинградская область', 'Северо-Западный', 59.447275, 29.48481),
(173, 'Волхов', 'volhov', 'Ленинградская область', 'Северо-Западный', 59.916744, 32.331544),
(174, 'Волчанск', 'volcansk', 'Свердловская область', 'Уральский', 59.934934, 60.078796),
(175, 'Вольск', 'volsk', 'Саратовская область', 'Приволжский', 52.045978, 47.38729),
(176, 'Воркута', 'vorkuta', 'Коми', 'Северо-Западный', 67.49741, 64.061091),
(177, 'Воронеж', 'voronez', 'Воронежская область', 'Центральный', 51.660781, 39.200269),
(178, 'Ворсма', 'vorsma', 'Нижегородская область', 'Приволжский', 55.98999, 43.271955),
(179, 'Воскресенск', 'voskresensk', 'Московская область', 'Центральный', 55.322978, 38.673353),
(180, 'Воткинск', 'votkinsk', 'Удмуртия', 'Приволжский', 57.051806, 53.987392),
(181, 'Всеволожск', 'vsevolozsk', 'Ленинградская область', 'Северо-Западный', 60.021317, 30.654084),
(182, 'Вуктыл', 'vuktyl', 'Коми', 'Северо-Западный', 63.844407, 57.29984),
(183, 'Выборг', 'vyborg', 'Ленинградская область', 'Северо-Западный', 60.710232, 28.749404),
(184, 'Выкса', 'vyksa', 'Нижегородская область', 'Приволжский', 55.320683, 42.167961),
(185, 'Высоковск', 'vysokovsk', 'Московская область', 'Центральный', 56.320243, 36.551236),
(186, 'Высоцк', 'vysock', 'Ленинградская область', 'Северо-Западный', 60.625264, 28.568016),
(187, 'Вытегра', 'vytegra', 'Вологодская область', 'Северо-Западный', 61.006355, 36.449511),
(188, 'ВышнийВолочёк', 'vysnijvolocek', 'Тверская область', 'Центральный', 61.006355, 36.449511),
(189, 'Вяземский', 'vazemskij', 'Хабаровский край', 'Дальневосточный', 47.535352, 134.755297),
(190, 'Вязники', 'vazniki', 'Владимирская область', 'Центральный', 56.247021, 42.158862),
(191, 'Вязьма', 'vazma', 'Смоленская область', 'Центральный', 55.205944, 34.298037),
(192, 'ВятскиеПоляны', 'vatskiepolany', 'Кировская область', 'Приволжский', 55.205944, 34.298037),
(193, 'ГавриловПосад', 'gavrilovposad', 'Ивановская область', 'Центральный', 55.205944, 34.298037),
(194, 'Гаврилов-Ям', 'gavrilov-am', 'Ярославская область', 'Центральный', 57.303309, 39.849086),
(195, 'Гаджиево', 'gadzievo', 'Мурманская область', 'Северо-Западный', 69.249049, 33.315262),
(196, 'Галич', 'galic', 'Костромская область', 'Центральный', 58.381199, 42.34749),
(197, 'Гатчина', 'gatcina', 'Ленинградская область', 'Северо-Западный', 59.568456, 30.124473),
(198, 'Гвардейск', 'gvardejsk', 'Калининградская область', 'Северо-Западный', 54.647708, 21.071341),
(199, 'Гдов', 'gdov', 'Псковская область', 'Северо-Западный', 58.744393, 27.819585),
(200, 'Геленджик', 'gelendzik', 'Краснодарский край', 'Южный', 44.561141, 38.076809),
(201, 'Георгиевск', 'georgievsk', 'Ставропольский край', 'Северо-Кавказский', 44.148599, 43.473896),
(202, 'Глазов', 'glazov', 'Удмуртия', 'Приволжский', 58.14081, 52.674235),
(203, 'Голицыно', 'golicyno', 'Московская область', 'Центральный', 55.615944, 36.987117),
(204, 'Горбатов', 'gorbatov', 'Нижегородская область', 'Приволжский', 56.130869, 43.062701),
(205, 'Горно-Алтайск', 'gorno-altajsk', 'Алтай', 'Сибирский', 51.958182, 85.960373),
(206, 'Горнозаводск', 'gornozavodsk', 'Пермский край', 'Приволжский', 58.374682, 58.330917),
(207, 'Горняк', 'gornak', 'Алтайский край', 'Сибирский', 50.997775, 81.464198),
(208, 'Городец', 'gorodec', 'Нижегородская область', 'Приволжский', 56.644822, 43.472351),
(209, 'Городище', 'gorodise', 'Пензенская область', 'Приволжский', 53.272758, 45.70267),
(210, 'Городовиковск', 'gorodovikovsk', 'Калмыкия', 'Южный', 46.083105, 41.936052),
(211, 'Гороховец', 'gorohovec', 'Владимирская область', 'Центральный', 56.201695, 42.691194),
(212, 'ГорячийКлюч', 'goracijkluc', 'Краснодарский край', 'Южный', 56.201695, 42.691194),
(213, 'Грайворон', 'grajvoron', 'Белгородская область', 'Центральный', 50.486223, 35.666351),
(214, 'Гремячинск', 'gremacinsk', 'Пермский край', 'Приволжский', 58.562599, 57.852034),
(215, 'Грозный', 'groznyj', 'Чечня', 'Северо-Кавказский', 43.317776, 45.694909),
(216, 'Грязи', 'grazi', 'Липецкая область', 'Центральный', 52.496186, 39.95533),
(217, 'Грязовец', 'grazovec', 'Вологодская область', 'Северо-Западный', 58.875793, 40.248423),
(218, 'Губаха', 'gubaha', 'Пермский край', 'Приволжский', 58.837018, 57.554575),
(219, 'Губкин', 'gubkin', 'Белгородская область', 'Центральный', 51.283644, 37.534748),
(220, 'Губкинский', 'gubkinskij', 'Ямало-Ненецкий АО', 'Уральский', 51.18651, 37.380687),
(221, 'Гудермес', 'gudermes', 'Чечня', 'Северо-Кавказский', 43.35188, 46.103535),
(222, 'Гуково', 'gukovo', 'Ростовская область', 'Южный', 48.058442, 39.940274),
(223, 'Гулькевичи', 'gulkevici', 'Краснодарский край', 'Южный', 45.360342, 40.695227),
(224, 'Гурьевск', 'gurevsk', 'Калининградская область', 'Северо-Западный', 54.285935, 85.947635),
(225, 'Гурьевск', 'gurevsk', 'Кемеровская область', 'Сибирский', 54.285935, 85.947635),
(226, 'Гусев', 'gusev', 'Калининградская область', 'Северо-Западный', 54.591841, 22.201117),
(227, 'Гусиноозёрск', 'gusinoozersk', 'Бурятия', 'Сибирский', 51.285526, 106.529323),
(228, 'Гусь-Хрустальный', 'gus-hrustalnyj', 'Владимирская область', 'Центральный', 55.619818, 40.657902),
(229, 'Давлеканово', 'davlekanovo', 'Башкортостан', 'Приволжский', 54.222727, 55.03127),
(230, 'ДагестанскиеОгни', 'dagestanskieogni', 'Дагестан', 'Северо-Кавказский', 54.222727, 55.03127),
(231, 'Далматово', 'dalmatovo', 'Курганская область', 'Уральский', 56.258608, 62.939311),
(232, 'Дальнегорск', 'dalnegorsk', 'Приморский край', 'Дальневосточный', 44.554018, 135.566179),
(233, 'Дальнереченск', 'dalnerecensk', 'Приморский край', 'Дальневосточный', 45.93085, 133.731738),
(234, 'Данилов', 'danilov', 'Ярославская область', 'Центральный', 58.187861, 40.174815),
(235, 'Данков', 'dankov', 'Липецкая область', 'Центральный', 53.246197, 39.134414),
(236, 'Дегтярск', 'degtarsk', 'Свердловская область', 'Уральский', 56.698463, 60.086674),
(237, 'Дедовск', 'dedovsk', 'Московская область', 'Центральный', 55.859984, 37.120669),
(238, 'Демидов', 'demidov', 'Смоленская область', 'Центральный', 55.26444, 31.515011),
(239, 'Дербент', 'derbent', 'Дагестан', 'Северо-Кавказский', 42.057669, 48.288776),
(240, 'Десногорск', 'desnogorsk', 'Смоленская область', 'Центральный', 54.152366, 33.287872),
(241, 'Дзержинск', 'dzerzinsk', 'Нижегородская область', 'Приволжский', 56.238377, 43.461625),
(242, 'Дзержинский', 'dzerzinskij', 'Московская область', 'Центральный', 55.630939, 37.849616),
(243, 'Дивногорск', 'divnogorsk', 'Красноярский край', 'Сибирский', 55.957721, 92.380148),
(244, 'Дигора', 'digora', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.156732, 44.155035),
(245, 'Димитровград', 'dimitrovgrad', 'Ульяновская область', 'Приволжский', 54.217715, 49.621984),
(246, 'Дмитриев', 'dmitriev', 'Курская область', 'Центральный', 52.127774, 35.080353),
(247, 'Дмитров', 'dmitrov', 'Московская область', 'Центральный', 56.343942, 37.520348),
(248, 'Дмитровск', 'dmitrovsk', 'Орловская область', 'Центральный', 52.505434, 35.14151),
(249, 'Дно', 'dno', 'Псковская область', 'Северо-Западный', 57.826914, 29.962992),
(250, 'Добрянка', 'dobranka', 'Пермский край', 'Приволжский', 58.468063, 56.403986),
(251, 'Долгопрудный', 'dolgoprudnyj', 'Московская область', 'Центральный', 55.933564, 37.514104),
(252, 'Долинск', 'dolinsk', 'Сахалинская область', 'Дальневосточный', 47.32624, 142.79344),
(253, 'Донецк', 'doneck', 'Ростовская область', 'Южный', 48.015877, 37.80285),
(254, 'Донской', 'donskoj', 'Тульская область', 'Центральный', 47.992758, 37.915058),
(255, 'Дорогобуж', 'dorogobuz', 'Смоленская область', 'Центральный', 54.912677, 33.297035),
(256, 'Дрезна', 'drezna', 'Московская область', 'Центральный', 55.741404, 38.842371),
(257, 'Дубна', 'dubna', 'Московская область', 'Центральный', 56.744002, 37.173176),
(258, 'Дубовка', 'dubovka', 'Волгоградская область', 'Южный', 49.055369, 44.826957),
(259, 'Дудинка', 'dudinka', 'Красноярский край', 'Сибирский', 69.403081, 86.190854),
(260, 'Духовщина', 'duhovsina', 'Смоленская область', 'Центральный', 55.191351, 32.414171),
(261, 'Дюртюли', 'durtuli', 'Башкортостан', 'Приволжский', 55.48529, 54.873463),
(262, 'Егорьевск', 'egorevsk', 'Московская область', 'Центральный', 55.38305, 39.035833),
(263, 'Ейск', 'ejsk', 'Краснодарский край', 'Южный', 46.711524, 38.276451),
(264, 'Екатеринбург', 'ekaterinburg', 'Свердловская область', 'Уральский', 56.838011, 60.597465),
(265, 'Елабуга', 'elabuga', 'Татарстан', 'Приволжский', 55.75667, 52.05446),
(266, 'Елец', 'elec', 'Липецкая область', 'Центральный', 52.62419, 38.503653),
(267, 'Елизово', 'elizovo', 'Камчатский край', 'Дальневосточный', 53.183053, 158.388355),
(268, 'Ельня', 'elna', 'Смоленская область', 'Центральный', 54.575906, 33.182734),
(269, 'Еманжелинск', 'emanzelinsk', 'Челябинская область', 'Уральский', 54.752147, 61.317223),
(270, 'Емва', 'emva', 'Коми', 'Северо-Западный', 62.598375, 50.886569),
(271, 'Енисейск', 'enisejsk', 'Красноярский край', 'Сибирский', 58.453069, 92.173769),
(272, 'Ермолино', 'ermolino', 'Калужская область', 'Центральный', 55.197204, 36.5952),
(273, 'Ершов', 'ersov', 'Саратовская область', 'Приволжский', 51.352068, 48.283494),
(274, 'Ессентуки', 'essentuki', 'Ставропольский край', 'Северо-Кавказский', 44.044526, 42.85891),
(275, 'Железноводск', 'zeleznovodsk', 'Ставропольский край', 'Северо-Кавказский', 44.132058, 43.030533),
(276, 'Железногорск', 'zeleznogorsk', 'Красноярский край', 'Сибирский', 52.337971, 35.351743),
(277, 'Железногорск', 'zeleznogorsk', 'Курская область', 'Центральный', 52.337971, 35.351743),
(278, 'Железногорск-Илимский', 'zeleznogorsk-ilimskij', 'Иркутская область', 'Сибирский', 56.584843, 104.114283),
(279, 'Жердевка', 'zerdevka', 'Тамбовская область', 'Центральный', 51.842282, 41.461796),
(280, 'Жигулёвск', 'zigulevsk', 'Самарская область', 'Приволжский', 53.401714, 49.494657),
(281, 'Жиздра', 'zizdra', 'Калужская область', 'Центральный', 53.749114, 34.734447),
(282, 'Жирновск', 'zirnovsk', 'Волгоградская область', 'Южный', 50.978713, 44.778834),
(283, 'Жуков', 'zukov', 'Калужская область', 'Центральный', 55.03167, 36.746503),
(284, 'Жуковка', 'zukovka', 'Брянская область', 'Центральный', 53.533062, 33.732547),
(285, 'Жуковский', 'zukovskij', 'Московская область', 'Центральный', 53.498298, 33.774598),
(286, 'Завитинск', 'zavitinsk', 'Амурская область', 'Дальневосточный', 50.106518, 129.439309),
(287, 'Заводоуковск', 'zavodoukovsk', 'Тюменская область', 'Уральский', 56.508808, 66.539174),
(288, 'Заволжск', 'zavolzsk', 'Ивановская область', 'Центральный', 57.491737, 42.137491),
(289, 'Заволжье', 'zavolze', 'Нижегородская область', 'Приволжский', 56.640441, 43.387164),
(290, 'Задонск', 'zadonsk', 'Липецкая область', 'Центральный', 52.391972, 38.919456),
(291, 'Заинск', 'zainsk', 'Татарстан', 'Приволжский', 55.298984, 52.006391),
(292, 'Закаменск', 'zakamensk', 'Бурятия', 'Сибирский', 50.372602, 103.286764),
(293, 'Заозёрный', 'zaozernyj', 'Красноярский край', 'Сибирский', 55.961818, 94.709228),
(294, 'Заозёрск', 'zaozersk', 'Мурманская область', 'Северо-Западный', 69.400373, 32.450139),
(295, 'ЗападнаяДвина', 'zapadnaadvina', 'Тверская область', 'Центральный', 69.400373, 32.450139),
(296, 'Заполярный', 'zapolarnyj', 'Мурманская область', 'Северо-Западный', 69.426103, 30.820739),
(297, 'Зарайск', 'zarajsk', 'Московская область', 'Центральный', 54.756973, 38.874845),
(298, 'Заречный', 'zarecnyj', 'Пензенская область', 'Приволжский', 53.19611, 45.169071),
(299, 'Заречный', 'zarecnyj', 'Свердловская область', 'Уральский', 53.19611, 45.169071),
(300, 'Заринск', 'zarinsk', 'Алтайский край', 'Сибирский', 53.706332, 84.931488),
(301, 'Звенигово', 'zvenigovo', 'Марий Эл', 'Приволжский', 55.972312, 48.01532),
(302, 'Звенигород', 'zvenigorod', 'Московская область', 'Центральный', 55.729686, 36.855325),
(303, 'Зверево', 'zverevo', 'Ростовская область', 'Южный', 55.499999, 36.926211),
(304, 'Зеленогорск', 'zelenogorsk', 'Красноярский край', 'Сибирский', 56.113246, 94.589006),
(305, 'Зеленоградск', 'zelenogradsk', 'Калининградская область', 'Северо-Западный', 54.95993, 20.475354),
(306, 'Зеленодольск', 'zelenodolsk', 'Татарстан', 'Приволжский', 55.846906, 48.500617),
(307, 'Зеленокумск', 'zelenokumsk', 'Ставропольский край', 'Северо-Кавказский', 44.403288, 43.884148),
(308, 'Зерноград', 'zernograd', 'Ростовская область', 'Южный', 46.849564, 40.312815),
(309, 'Зея', 'zea', 'Амурская область', 'Дальневосточный', 53.734033, 127.265889),
(310, 'Зима', 'zima', 'Иркутская область', 'Сибирский', 53.92072, 102.049065),
(311, 'Златоуст', 'zlatoust', 'Челябинская область', 'Уральский', 55.172871, 59.671841),
(312, 'Злынка', 'zlynka', 'Брянская область', 'Центральный', 52.427384, 31.737075),
(313, 'Змеиногорск', 'zmeinogorsk', 'Алтайский край', 'Сибирский', 51.158015, 82.18727),
(314, 'Знаменск', 'znamensk', 'Астраханская область', 'Южный', 48.586634, 45.736744),
(315, 'Зубцов', 'zubcov', 'Тверская область', 'Центральный', 56.176143, 34.58256),
(316, 'Зуевка', 'zuevka', 'Кировская область', 'Приволжский', 58.403217, 51.133426),
(317, 'Ивангород', 'ivangorod', 'Ленинградская область', 'Северо-Западный', 59.376655, 28.223117),
(318, 'Иваново', 'ivanovo', 'Ивановская область', 'Центральный', 57.000348, 40.973921),
(319, 'Ивантеевка', 'ivanteevka', 'Московская область', 'Центральный', 55.971718, 37.924338),
(320, 'Ивдель', 'ivdel', 'Свердловская область', 'Уральский', 60.697349, 60.41729),
(321, 'Игарка', 'igarka', 'Красноярский край', 'Сибирский', 67.466954, 86.567715),
(322, 'Ижевск', 'izevsk', 'Удмуртия', 'Приволжский', 56.852593, 53.204843),
(323, 'Избербаш', 'izberbas', 'Дагестан', 'Северо-Кавказский', 42.565141, 47.871078),
(324, 'Изобильный', 'izobilnyj', 'Ставропольский край', 'Северо-Кавказский', 45.368536, 41.708644),
(325, 'Иланский', 'ilanskij', 'Красноярский край', 'Сибирский', 56.238552, 96.065297),
(326, 'Инза', 'inza', 'Ульяновская область', 'Приволжский', 53.857035, 46.351649),
(327, 'Иннополис', 'innopolis', 'Татарстан', 'Приволжский', 55.75208, 48.744609),
(328, 'Инсар', 'insar', 'Мордовия', 'Приволжский', 53.866508, 44.372248),
(329, 'Инта', 'inta', 'Коми', 'Северо-Западный', 66.03682, 60.115367),
(330, 'Ипатово', 'ipatovo', 'Ставропольский край', 'Северо-Кавказский', 45.717419, 42.911147),
(331, 'Ирбит', 'irbit', 'Свердловская область', 'Уральский', 57.683819, 63.057664),
(332, 'Иркутск', 'irkutsk', 'Иркутская область', 'Сибирский', 52.287054, 104.281047),
(333, 'Исилькуль', 'isilkul', 'Омская область', 'Сибирский', 54.911844, 71.266945),
(334, 'Искитим', 'iskitim', 'Новосибирская область', 'Сибирский', 54.642582, 83.306382),
(335, 'Истра', 'istra', 'Московская область', 'Центральный', 55.914287, 36.860284),
(336, 'Ишим', 'isim', 'Тюменская область', 'Уральский', 56.11055, 69.479639),
(337, 'Ишимбай', 'isimbaj', 'Башкортостан', 'Приволжский', 53.454621, 56.04395),
(338, 'Йошкар-Ола', 'joskar-ola', 'Марий Эл', 'Приволжский', 56.630842, 47.886089),
(339, 'Кадников', 'kadnikov', 'Вологодская область', 'Северо-Западный', 59.503767, 40.34404),
(340, 'Казань', 'kazan', 'Татарстан', 'Приволжский', 55.796289, 49.108795),
(341, 'Калач', 'kalac', 'Воронежская область', 'Центральный', 50.424119, 41.01624),
(342, 'Калач-на-Дону', 'kalac-na-donu', 'Волгоградская область', 'Южный', 48.681995, 43.538234),
(343, 'Калачинск', 'kalacinsk', 'Омская область', 'Сибирский', 55.052608, 74.581782),
(344, 'Калининград', 'kaliningrad', 'Калининградская область', 'Северо-Западный', 54.70739, 20.507307),
(345, 'Калининск', 'kalininsk', 'Саратовская область', 'Приволжский', 51.499671, 44.48548),
(346, 'Калтан', 'kaltan', 'Кемеровская область', 'Сибирский', 53.521083, 87.27716),
(347, 'Калуга', 'kaluga', 'Калужская область', 'Центральный', 54.513845, 36.261215),
(348, 'Калязин', 'kalazin', 'Тверская область', 'Центральный', 57.240412, 37.855078),
(349, 'Камбарка', 'kambarka', 'Удмуртия', 'Приволжский', 56.266057, 54.193358),
(350, 'Каменка', 'kamenka', 'Пензенская область', 'Приволжский', 53.185524, 44.046896),
(351, 'Каменногорск', 'kamennogorsk', 'Ленинградская область', 'Северо-Западный', 60.95081, 29.130882),
(352, 'Каменск-Уральский', 'kamensk-uralskij', 'Свердловская область', 'Уральский', 56.414927, 61.918708),
(353, 'Каменск-Шахтинский', 'kamensk-sahtinskij', 'Ростовская область', 'Южный', 48.320515, 40.268923),
(354, 'Камень-на-Оби', 'kamen-na-obi', 'Алтайский край', 'Сибирский', 53.791486, 81.354558),
(355, 'Камешково', 'kameskovo', 'Владимирская область', 'Центральный', 56.348916, 40.995588),
(356, 'Камызяк', 'kamyzak', 'Астраханская область', 'Южный', 46.110571, 48.073235),
(357, 'Камышин', 'kamysin', 'Волгоградская область', 'Южный', 50.083698, 45.407367),
(358, 'Камышлов', 'kamyslov', 'Свердловская область', 'Уральский', 56.846578, 62.712288),
(359, 'Канаш', 'kanas', 'Чувашия', 'Приволжский', 55.506943, 47.491764),
(360, 'Кандалакша', 'kandalaksa', 'Мурманская область', 'Северо-Западный', 67.151252, 32.412823),
(361, 'Канск', 'kansk', 'Красноярский край', 'Сибирский', 56.205045, 95.705055),
(362, 'Карабаново', 'karabanovo', 'Владимирская область', 'Центральный', 56.313269, 38.703438),
(363, 'Карабаш', 'karabas', 'Челябинская область', 'Уральский', 55.490789, 60.203042),
(364, 'Карабулак', 'karabulak', 'Ингушетия', 'Северо-Кавказский', 43.305594, 44.909404),
(365, 'Карасук', 'karasuk', 'Новосибирская область', 'Сибирский', 53.734294, 78.042389),
(366, 'Карачаевск', 'karacaevsk', 'Карачаево-Черкесия', 'Северо-Кавказский', 43.773167, 41.914313),
(367, 'Карачев', 'karacev', 'Брянская область', 'Центральный', 53.121594, 34.982796),
(368, 'Каргат', 'kargat', 'Новосибирская область', 'Сибирский', 55.194476, 80.283039),
(369, 'Каргополь', 'kargopol', 'Архангельская область', 'Северо-Западный', 61.505339, 38.948166),
(370, 'Карпинск', 'karpinsk', 'Свердловская область', 'Уральский', 59.766534, 60.001227),
(371, 'Карталы', 'kartaly', 'Челябинская область', 'Уральский', 53.053681, 60.647753),
(372, 'Касимов', 'kasimov', 'Рязанская область', 'Центральный', 54.937288, 41.391368),
(373, 'Касли', 'kasli', 'Челябинская область', 'Уральский', 55.893652, 60.765918),
(374, 'Каспийск', 'kaspijsk', 'Дагестан', 'Северо-Кавказский', 42.890833, 47.635674),
(375, 'Катав-Ивановск', 'katav-ivanovsk', 'Челябинская область', 'Уральский', 54.752074, 58.198443),
(376, 'Катайск', 'katajsk', 'Курганская область', 'Уральский', 56.283235, 62.58365),
(377, 'Качканар', 'kackanar', 'Свердловская область', 'Уральский', 58.70511, 59.483959),
(378, 'Кашин', 'kasin', 'Тверская область', 'Центральный', 57.358381, 37.61344),
(379, 'Кашира', 'kasira', 'Московская область', 'Центральный', 54.834589, 38.15154),
(380, 'Кедровый', 'kedrovyj', 'Томская область', 'Сибирский', 57.560963, 79.566965),
(381, 'Кемерово', 'kemerovo', 'Кемеровская область', 'Сибирский', 55.354727, 86.088374),
(382, 'Кемь', 'kem', 'Карелия', 'Северо-Западный', 64.955532, 34.598371),
(383, 'КерчьОспаривается', 'kercosparivaetsa', 'Крым', 'Южный', 45.356219, 36.467378),
(384, 'Кизел', 'kizel', 'Пермский край', 'Приволжский', 59.049425, 57.653875),
(385, 'Кизилюрт', 'kizilurt', 'Дагестан', 'Северо-Кавказский', 43.204637, 46.866878),
(386, 'Кизляр', 'kizlar', 'Дагестан', 'Северо-Кавказский', 43.84738, 46.711685),
(387, 'Кимовск', 'kimovsk', 'Тульская область', 'Центральный', 53.972149, 38.533063),
(388, 'Кимры', 'kimry', 'Тверская область', 'Центральный', 56.873338, 37.355678),
(389, 'Кингисепп', 'kingisepp', 'Ленинградская область', 'Северо-Западный', 59.374028, 28.611297),
(390, 'Кинель', 'kinel', 'Самарская область', 'Приволжский', 53.221004, 50.634394),
(391, 'Кинешма', 'kinesma', 'Ивановская область', 'Центральный', 57.442544, 42.168923),
(392, 'Киреевск', 'kireevsk', 'Тульская область', 'Центральный', 53.934944, 37.928542),
(393, 'Киренск', 'kirensk', 'Иркутская область', 'Сибирский', 57.775723, 108.110816),
(394, 'Киржач', 'kirzac', 'Владимирская область', 'Центральный', 56.161709, 38.872052),
(395, 'Кириллов', 'kirillov', 'Вологодская область', 'Северо-Западный', 59.859059, 38.374933),
(396, 'Кириши', 'kirisi', 'Ленинградская область', 'Северо-Западный', 59.449695, 32.008707),
(397, 'Киров', 'kirov', 'Калужская область', 'Центральный', 58.603581, 49.667978),
(398, 'Киров', 'kirov', 'Кировская область', 'Приволжский', 58.603581, 49.667978),
(399, 'Кировград', 'kirovgrad', 'Свердловская область', 'Уральский', 57.432415, 60.062896),
(400, 'Кирово-Чепецк', 'kirovo-cepeck', 'Кировская область', 'Приволжский', 58.556581, 50.043932),
(401, 'Кировск', 'kirovsk', 'Ленинградская область', 'Северо-Западный', 67.612101, 33.668165),
(402, 'Кировск', 'kirovsk', 'Мурманская область', 'Северо-Западный', 67.612101, 33.668165),
(403, 'Кирс', 'kirs', 'Кировская область', 'Приволжский', 59.339987, 52.241516),
(404, 'Кирсанов', 'kirsanov', 'Тамбовская область', 'Центральный', 52.650646, 42.728663),
(405, 'Киселёвск', 'kiselevsk', 'Кемеровская область', 'Сибирский', 54.006025, 86.636679),
(406, 'Кисловодск', 'kislovodsk', 'Ставропольский край', 'Северо-Кавказский', 43.905225, 42.716796),
(407, 'Клин', 'klin', 'Московская область', 'Центральный', 56.331693, 36.728716),
(408, 'Клинцы', 'klincy', 'Брянская область', 'Центральный', 52.753143, 32.233852),
(409, 'Княгинино', 'knaginino', 'Нижегородская область', 'Приволжский', 55.820566, 45.032249),
(410, 'Ковдор', 'kovdor', 'Мурманская область', 'Северо-Западный', 67.562914, 30.474025),
(411, 'Ковылкино', 'kovylkino', 'Мордовия', 'Приволжский', 54.039201, 43.919056),
(412, 'Когалым', 'kogalym', 'Ханты-Мансийский АО — Югра', 'Уральский', 62.264069, 74.482761),
(413, 'Кодинск', 'kodinsk', 'Красноярский край', 'Сибирский', 58.603398, 99.179748),
(414, 'Козельск', 'kozelsk', 'Калужская область', 'Центральный', 54.034823, 35.78226),
(415, 'Козловка', 'kozlovka', 'Чувашия', 'Приволжский', 55.840386, 48.245127),
(416, 'Козьмодемьянск', 'kozmodemansk', 'Марий Эл', 'Приволжский', 56.344167, 46.568107),
(417, 'Кола', 'kola', 'Мурманская область', 'Северо-Западный', 68.878636, 33.026247),
(418, 'Кологрив', 'kologriv', 'Костромская область', 'Центральный', 58.826929, 44.318762),
(419, 'Коломна', 'kolomna', 'Московская область', 'Центральный', 55.103152, 38.752917),
(420, 'Колпашево', 'kolpasevo', 'Томская область', 'Сибирский', 58.311384, 82.902679),
(421, 'Кольчугино', 'kolcugino', 'Владимирская область', 'Центральный', 56.293901, 39.376042),
(422, 'Коммунар', 'kommunar', 'Ленинградская область', 'Северо-Западный', 59.621609, 30.393483),
(423, 'Комсомольск', 'komsomolsk', 'Ивановская область', 'Центральный', 57.027394, 40.37761),
(424, 'Комсомольск-на-Амуре', 'komsomolsk-na-amure', 'Хабаровский край', 'Дальневосточный', 50.549923, 137.007948),
(425, 'Конаково', 'konakovo', 'Тверская область', 'Центральный', 56.713217, 36.779309),
(426, 'Кондопога', 'kondopoga', 'Карелия', 'Северо-Западный', 62.20475, 34.272758),
(427, 'Кондрово', 'kondrovo', 'Калужская область', 'Центральный', 54.80743, 35.926647),
(428, 'Константиновск', 'konstantinovsk', 'Ростовская область', 'Южный', 47.577341, 41.096694),
(429, 'Копейск', 'kopejsk', 'Челябинская область', 'Уральский', 55.116732, 61.61797),
(430, 'Кораблино', 'korablino', 'Рязанская область', 'Центральный', 53.926812, 40.034463),
(431, 'Кореновск', 'korenovsk', 'Краснодарский край', 'Южный', 45.462742, 39.448033),
(432, 'Коркино', 'korkino', 'Челябинская область', 'Уральский', 54.892493, 61.393049),
(433, 'Королёв', 'korolev', 'Московская область', 'Центральный', 55.922212, 37.854629),
(434, 'Короча', 'koroca', 'Белгородская область', 'Центральный', 50.811036, 37.194942),
(435, 'Корсаков', 'korsakov', 'Сахалинская область', 'Дальневосточный', 46.63498, 142.78257),
(436, 'Коряжма', 'korazma', 'Архангельская область', 'Северо-Западный', 61.315335, 47.159855),
(437, 'Костерёво', 'kosterevo', 'Владимирская область', 'Центральный', 55.933701, 39.624732),
(438, 'Костомукша', 'kostomuksa', 'Карелия', 'Северо-Западный', 64.588014, 30.598361),
(439, 'Кострома', 'kostroma', 'Костромская область', 'Центральный', 57.767961, 40.926858),
(440, 'Котельники', 'kotelniki', 'Московская область', 'Центральный', 55.65984, 37.863199),
(441, 'Котельниково', 'kotelnikovo', 'Волгоградская область', 'Южный', 47.631528, 43.142625),
(442, 'Котельнич', 'kotelnic', 'Кировская область', 'Приволжский', 58.303426, 48.347508),
(443, 'Котлас', 'kotlas', 'Архангельская область', 'Северо-Западный', 61.25297, 46.633217),
(444, 'Котово', 'kotovo', 'Волгоградская область', 'Южный', 50.322058, 44.801319),
(445, 'Котовск', 'kotovsk', 'Тамбовская область', 'Центральный', 52.59292, 41.50575),
(446, 'Кохма', 'kohma', 'Ивановская область', 'Центральный', 56.932531, 41.093208),
(447, 'Красавино', 'krasavino', 'Вологодская область', 'Северо-Западный', 60.961377, 46.481474),
(448, 'Красноармейск', 'krasnoarmejsk', 'Московская область', 'Центральный', 56.120959, 38.14094),
(449, 'Красноармейск', 'krasnoarmejsk', 'Саратовская область', 'Приволжский', 56.120959, 38.14094),
(450, 'Красновишерск', 'krasnovisersk', 'Пермский край', 'Приволжский', 60.412821, 57.083301),
(451, 'Красногорск', 'krasnogorsk', 'Московская область', 'Центральный', 55.831099, 37.330192),
(452, 'Краснодар', 'krasnodar', 'Краснодарский край', 'Южный', 45.03547, 38.975313),
(453, 'Краснозаводск', 'krasnozavodsk', 'Московская область', 'Центральный', 56.439338, 38.245261),
(454, 'Краснознаменск', 'krasnoznamensk', 'Калининградская область', 'Северо-Западный', 55.600506, 37.042489),
(455, 'Краснознаменск', 'krasnoznamensk', 'Московская область', 'Центральный', 55.600506, 37.042489),
(456, 'Краснокаменск', 'krasnokamensk', 'Забайкальский край', 'Сибирский', 50.09372, 118.033256),
(457, 'Краснокамск', 'krasnokamsk', 'Пермский край', 'Приволжский', 58.078357, 55.736376),
(458, 'Краснослободск', 'krasnoslobodsk', 'Волгоградская область', 'Южный', 54.424901, 43.784435),
(459, 'Краснослободск', 'krasnoslobodsk', 'Мордовия', 'Приволжский', 54.424901, 43.784435),
(460, 'Краснотурьинск', 'krasnoturinsk', 'Свердловская область', 'Уральский', 59.763761, 60.193493),
(461, 'Красноуральск', 'krasnouralsk', 'Свердловская область', 'Уральский', 58.35369, 60.055961),
(462, 'Красноуфимск', 'krasnoufimsk', 'Свердловская область', 'Уральский', 56.617744, 57.770692),
(463, 'Красноярск', 'krasnoarsk', 'Красноярский край', 'Сибирский', 56.010563, 92.852572),
(464, 'КрасныйКут', 'krasnyjkut', 'Саратовская область', 'Приволжский', 56.010563, 92.852572),
(465, 'КрасныйСулин', 'krasnyjsulin', 'Ростовская область', 'Южный', 56.010563, 92.852572),
(466, 'КрасныйХолм', 'krasnyjholm', 'Тверская область', 'Центральный', 56.010563, 92.852572),
(467, 'Кремёнки', 'kremenki', 'Калужская область', 'Центральный', 54.887036, 37.116232),
(468, 'Кропоткин', 'kropotkin', 'Краснодарский край', 'Южный', 45.434686, 40.575994),
(469, 'Крымск', 'krymsk', 'Краснодарский край', 'Южный', 44.934986, 37.986196),
(470, 'Кстово', 'kstovo', 'Нижегородская область', 'Приволжский', 56.15067, 44.206751),
(471, 'Кубинка', 'kubinka', 'Московская область', 'Центральный', 55.575556, 36.695209),
(472, 'Кувандык', 'kuvandyk', 'Оренбургская область', 'Приволжский', 51.478483, 57.361168),
(473, 'Кувшиново', 'kuvsinovo', 'Тверская область', 'Центральный', 57.028957, 34.165877),
(474, 'Кудрово', 'kudrovo', 'Ленинградская область', 'Северо-Западный', 59.908489, 30.513569),
(475, 'Кудымкар', 'kudymkar', 'Пермский край', 'Приволжский', 59.014548, 54.664183),
(476, 'Кузнецк', 'kuzneck', 'Пензенская область', 'Приволжский', 53.119335, 46.601165),
(477, 'Куйбышев', 'kujbysev', 'Новосибирская область', 'Сибирский', 53.195538, 50.101783),
(478, 'Кукмор', 'kukmor', 'Татарстан', 'Приволжский', 56.186599, 50.893981),
(479, 'Кулебаки', 'kulebaki', 'Нижегородская область', 'Приволжский', 55.429716, 42.512483),
(480, 'Кумертау', 'kumertau', 'Башкортостан', 'Приволжский', 52.756523, 55.796976),
(481, 'Кунгур', 'kungur', 'Пермский край', 'Приволжский', 57.42881, 56.944206),
(482, 'Купино', 'kupino', 'Новосибирская область', 'Сибирский', 54.366046, 77.297254),
(483, 'Курган', 'kurgan', 'Курганская область', 'Уральский', 55.441004, 65.341118),
(484, 'Курганинск', 'kurganinsk', 'Краснодарский край', 'Южный', 44.887641, 40.591364),
(485, 'Курильск', 'kurilsk', 'Сахалинская область', 'Дальневосточный', 45.225174, 147.883761),
(486, 'Курлово', 'kurlovo', 'Владимирская область', 'Центральный', 55.454968, 40.611208),
(487, 'Куровское', 'kurovskoe', 'Московская область', 'Центральный', 55.579144, 38.920866),
(488, 'Курск', 'kursk', 'Курская область', 'Центральный', 51.730361, 36.192647),
(489, 'Куртамыш', 'kurtamys', 'Курганская область', 'Уральский', 54.912459, 64.433505),
(490, 'Курчалой', 'kurcaloj', 'Чечня', 'Северо-Кавказский', 43.20463, 46.088955),
(491, 'Курчатов', 'kurcatov', 'Курская область', 'Центральный', 51.660496, 35.657143),
(492, 'Куса', 'kusa', 'Челябинская область', 'Уральский', 55.338597, 59.438603),
(493, 'Кушва', 'kusva', 'Свердловская область', 'Уральский', 58.282566, 59.764682),
(494, 'Кызыл', 'kyzyl', 'Тыва', 'Сибирский', 51.719086, 94.437757),
(495, 'Кыштым', 'kystym', 'Челябинская область', 'Уральский', 55.707877, 60.538949),
(496, 'Кяхта', 'kahta', 'Бурятия', 'Сибирский', 50.355214, 106.449903),
(497, 'Лабинск', 'labinsk', 'Краснодарский край', 'Южный', 44.635387, 40.724459),
(498, 'Лабытнанги', 'labytnangi', 'Ямало-Ненецкий АО', 'Уральский', 66.660595, 66.383963),
(499, 'Лагань', 'lagan', 'Калмыкия', 'Южный', 45.392947, 47.355202),
(500, 'Ладушкин', 'laduskin', 'Калининградская область', 'Северо-Западный', 54.569116, 20.172954),
(501, 'Лаишево', 'laisevo', 'Татарстан', 'Приволжский', 55.402449, 49.543328),
(502, 'Лакинск', 'lakinsk', 'Владимирская область', 'Центральный', 56.018001, 39.956525),
(503, 'Лангепас', 'langepas', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.253701, 75.180725),
(504, 'Лахденпохья', 'lahdenpoha', 'Карелия', 'Северо-Западный', 61.518857, 30.199491),
(505, 'Лебедянь', 'lebedan', 'Липецкая область', 'Центральный', 53.020489, 39.13135),
(506, 'Лениногорск', 'leninogorsk', 'Татарстан', 'Приволжский', 54.599028, 52.442667),
(507, 'Ленинск', 'leninsk', 'Волгоградская область', 'Южный', 48.693682, 45.199228),
(508, 'Ленинск-Кузнецкий', 'leninsk-kuzneckij', 'Кемеровская область', 'Сибирский', 54.663609, 86.162243),
(509, 'Ленск', 'lensk', 'Якутия', 'Дальневосточный', 60.713731, 114.911844),
(510, 'Лермонтов', 'lermontov', 'Ставропольский край', 'Северо-Кавказский', 44.105344, 42.973175),
(511, 'Лесозаводск', 'lesozavodsk', 'Приморский край', 'Дальневосточный', 45.477955, 133.418594),
(512, 'Лесосибирск', 'lesosibirsk', 'Красноярский край', 'Сибирский', 58.221728, 92.503657),
(513, 'Ливны', 'livny', 'Орловская область', 'Центральный', 52.426549, 37.608041),
(514, 'Ликино-Дулёво', 'likino-dulevo', 'Московская область', 'Центральный', 55.707786, 38.957742),
(515, 'Липецк', 'lipeck', 'Липецкая область', 'Центральный', 52.60882, 39.59922),
(516, 'Липки', 'lipki', 'Тульская область', 'Центральный', 53.94175, 37.701915),
(517, 'Лиски', 'liski', 'Воронежская область', 'Центральный', 50.987298, 39.497099),
(518, 'Лихославль', 'lihoslavl', 'Тверская область', 'Центральный', 57.122219, 35.466808),
(519, 'Лобня', 'lobna', 'Московская область', 'Центральный', 56.012269, 37.474821),
(520, 'ЛодейноеПоле', 'lodejnoepole', 'Ленинградская область', 'Северо-Западный', 56.012269, 37.474821),
(521, 'Лосино-Петровский', 'losino-petrovskij', 'Московская область', 'Центральный', 55.87137, 38.200606),
(522, 'Луга', 'luga', 'Ленинградская область', 'Северо-Западный', 58.735221, 29.847999),
(523, 'Луза', 'luza', 'Кировская область', 'Приволжский', 60.629099, 47.261229),
(524, 'Лукоянов', 'lukoanov', 'Нижегородская область', 'Приволжский', 55.032697, 44.493349),
(525, 'Луховицы', 'luhovicy', 'Московская область', 'Центральный', 54.965217, 39.025394),
(526, 'Лысково', 'lyskovo', 'Нижегородская область', 'Приволжский', 56.021357, 45.040962),
(527, 'Лысьва', 'lysva', 'Пермский край', 'Приволжский', 58.100413, 57.811655),
(528, 'Лыткарино', 'lytkarino', 'Московская область', 'Центральный', 55.579297, 37.908986),
(529, 'Льгов', 'lgov', 'Курская область', 'Центральный', 51.656942, 35.259432),
(530, 'Любань', 'luban', 'Ленинградская область', 'Северо-Западный', 52.798914, 27.993481),
(531, 'Люберцы', 'lubercy', 'Московская область', 'Центральный', 55.676494, 37.898116),
(532, 'Любим', 'lubim', 'Ярославская область', 'Центральный', 58.362004, 40.686873),
(533, 'Людиново', 'ludinovo', 'Калужская область', 'Центральный', 53.864607, 34.447678),
(534, 'Лянтор', 'lantor', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.620663, 72.155352),
(535, 'Магадан', 'magadan', 'Магаданская область', 'Дальневосточный', 59.568164, 150.808541),
(536, 'Магас', 'magas', 'Ингушетия', 'Северо-Кавказский', 43.171501, 44.81624),
(537, 'Магнитогорск', 'magnitogorsk', 'Челябинская область', 'Уральский', 53.407158, 58.980282),
(538, 'Майкоп', 'majkop', 'Адыгея', 'Южный', 44.608865, 40.098548),
(539, 'Майский', 'majskij', 'Кабардино-Балкария', 'Северо-Кавказский', 44.605753, 40.093069),
(540, 'Макаров', 'makarov', 'Сахалинская область', 'Дальневосточный', 48.625101, 142.778851),
(541, 'Макарьев', 'makarev', 'Костромская область', 'Центральный', 57.880009, 43.807836),
(542, 'Макушино', 'makusino', 'Курганская область', 'Уральский', 55.205024, 67.248601),
(543, 'МалаяВишера', 'malaavisera', 'Новгородская область', 'Северо-Западный', 55.205024, 67.248601),
(544, 'Малгобек', 'malgobek', 'Ингушетия', 'Северо-Кавказский', 43.509645, 44.590188),
(545, 'Малмыж', 'malmyz', 'Кировская область', 'Приволжский', 56.524461, 50.678232),
(546, 'Малоархангельск', 'maloarhangelsk', 'Орловская область', 'Центральный', 52.400974, 36.502107),
(547, 'Малоярославец', 'maloaroslavec', 'Калужская область', 'Центральный', 55.011897, 36.462555),
(548, 'Мамадыш', 'mamadys', 'Татарстан', 'Приволжский', 55.717771, 51.410224),
(549, 'Мамоново', 'mamonovo', 'Калининградская область', 'Северо-Западный', 54.463785, 19.942267),
(550, 'Мантурово', 'manturovo', 'Костромская область', 'Центральный', 58.328617, 44.757292),
(551, 'Мариинск', 'mariinsk', 'Кемеровская область', 'Сибирский', 56.206952, 87.742263),
(552, 'МариинскийПосад', 'mariinskijposad', 'Чувашия', 'Приволжский', 56.206952, 87.742263),
(553, 'Маркс', 'marks', 'Саратовская область', 'Приволжский', 51.713333, 46.740009),
(554, 'Махачкала', 'mahackala', 'Дагестан', 'Северо-Кавказский', 42.98306, 47.504682),
(555, 'Мглин', 'mglin', 'Брянская область', 'Центральный', 53.061069, 32.847806),
(556, 'Мегион', 'megion', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.03289, 76.102612),
(557, 'Медвежьегорск', 'medvezegorsk', 'Карелия', 'Северо-Западный', 62.914998, 34.473101),
(558, 'Медногорск', 'mednogorsk', 'Оренбургская область', 'Приволжский', 51.403794, 57.58324),
(559, 'Медынь', 'medyn', 'Калужская область', 'Центральный', 54.968784, 35.857701),
(560, 'Межгорье', 'mezgore', 'Башкортостан', 'Приволжский', 54.239989, 57.961225),
(561, 'Междуреченск', 'mezdurecensk', 'Кемеровская область', 'Сибирский', 53.686596, 88.070372),
(562, 'Мезень', 'mezen', 'Архангельская область', 'Северо-Западный', 65.839904, 44.25314),
(563, 'Меленки', 'melenki', 'Владимирская область', 'Центральный', 55.338715, 41.63403),
(564, 'Мелеуз', 'meleuz', 'Башкортостан', 'Приволжский', 52.958964, 55.92831),
(565, 'Менделеевск', 'mendeleevsk', 'Татарстан', 'Приволжский', 55.895186, 52.314397),
(566, 'Мензелинск', 'menzelinsk', 'Татарстан', 'Приволжский', 55.719972, 53.101429),
(567, 'Мещовск', 'mesovsk', 'Калужская область', 'Центральный', 54.321476, 35.278081),
(568, 'Миасс', 'miass', 'Челябинская область', 'Уральский', 55.045635, 60.107731),
(569, 'Микунь', 'mikun', 'Коми', 'Северо-Западный', 62.358008, 50.071986),
(570, 'Миллерово', 'millerovo', 'Ростовская область', 'Южный', 48.92173, 40.394849),
(571, 'МинеральныеВоды', 'mineralnyevody', 'Ставропольский край', 'Северо-Кавказский', 48.92173, 40.394849),
(572, 'Минусинск', 'minusinsk', 'Красноярский край', 'Сибирский', 53.710564, 91.687268),
(573, 'Миньяр', 'minar', 'Челябинская область', 'Уральский', 55.070912, 57.548458),
(574, 'Мирный', 'mirnyj', 'Якутия', 'Дальневосточный', 62.541028, 113.978692);
INSERT INTO `city` (`id`, `name`, `slug`, `region`, `district`, `lat`, `lng`) VALUES
(575, 'Мирный', 'mirnyj', 'Архангельская область', 'Северо-Западный', 62.541028, 113.978692),
(576, 'Михайлов', 'mihajlov', 'Рязанская область', 'Центральный', 54.232506, 39.023508),
(577, 'Михайловка', 'mihajlovka', 'Волгоградская область', 'Южный', 50.070847, 43.239723),
(578, 'Михайловск', 'mihajlovsk', 'Свердловская область', 'Уральский', 45.129667, 42.028803),
(579, 'Михайловск', 'mihajlovsk', 'Ставропольский край', 'Северо-Кавказский', 45.129667, 42.028803),
(580, 'Мичуринск', 'micurinsk', 'Тамбовская область', 'Центральный', 52.893913, 40.498011),
(581, 'Могоча', 'mogoca', 'Забайкальский край', 'Сибирский', 53.736206, 119.76608),
(582, 'Можайск', 'mozajsk', 'Московская область', 'Центральный', 55.506714, 36.017358),
(583, 'Можга', 'mozga', 'Удмуртия', 'Приволжский', 56.442802, 52.213839),
(584, 'Моздок', 'mozdok', 'Северная Осетия — Алания', 'Северо-Кавказский', 43.735413, 44.653878),
(585, 'Мончегорск', 'moncegorsk', 'Мурманская область', 'Северо-Западный', 67.938931, 32.937116),
(586, 'Морозовск', 'morozovsk', 'Ростовская область', 'Южный', 48.351157, 41.830878),
(587, 'Моршанск', 'morsansk', 'Тамбовская область', 'Центральный', 53.443611, 41.811627),
(588, 'Мосальск', 'mosalsk', 'Калужская область', 'Центральный', 54.491307, 34.984197),
(589, 'Москва', 'moskva', 'Москва', 'Центральный', 55.753215, 37.622504),
(590, 'Муравленко', 'muravlenko', 'Ямало-Ненецкий АО', 'Уральский', 63.795285, 74.494448),
(591, 'Мураши', 'murasi', 'Кировская область', 'Приволжский', 59.3956, 48.963851),
(592, 'Мурманск', 'murmansk', 'Мурманская область', 'Северо-Западный', 68.970682, 33.074981),
(593, 'Муром', 'murom', 'Владимирская область', 'Центральный', 55.579169, 42.052411),
(594, 'Мценск', 'mcensk', 'Орловская область', 'Центральный', 53.278939, 36.575006),
(595, 'Мыски', 'myski', 'Кемеровская область', 'Сибирский', 53.712509, 87.805747),
(596, 'Мытищи', 'mytisi', 'Московская область', 'Центральный', 55.910483, 37.736402),
(597, 'Мышкин', 'myskin', 'Ярославская область', 'Центральный', 57.787134, 38.455332),
(598, 'НабережныеЧелны', 'nabereznyecelny', 'Татарстан', 'Приволжский', 57.787134, 38.455332),
(599, 'Навашино', 'navasino', 'Нижегородская область', 'Приволжский', 55.543888, 42.18874),
(600, 'Наволоки', 'navoloki', 'Ивановская область', 'Центральный', 57.470588, 41.957765),
(601, 'Надым', 'nadym', 'Ямало-Ненецкий АО', 'Уральский', 65.535924, 72.531341),
(602, 'Назарово', 'nazarovo', 'Красноярский край', 'Сибирский', 56.012345, 90.417688),
(603, 'Назрань', 'nazran', 'Ингушетия', 'Северо-Кавказский', 43.225727, 44.764641),
(604, 'Называевск', 'nazyvaevsk', 'Омская область', 'Сибирский', 55.567066, 71.348718),
(605, 'Нальчик', 'nalcik', 'Кабардино-Балкария', 'Северо-Кавказский', 43.485259, 43.607072),
(606, 'Нариманов', 'narimanov', 'Астраханская область', 'Южный', 46.690301, 47.853623),
(607, 'Наро-Фоминск', 'naro-fominsk', 'Московская область', 'Центральный', 55.38616, 36.734493),
(608, 'Нарткала', 'nartkala', 'Кабардино-Балкария', 'Северо-Кавказский', 43.556734, 43.862022),
(609, 'Нарьян-Мар', 'naran-mar', 'Ненецкий АО', 'Северо-Западный', 67.63805, 53.006926),
(610, 'Находка', 'nahodka', 'Приморский край', 'Дальневосточный', 42.824037, 132.892811),
(611, 'Невель', 'nevel', 'Псковская область', 'Северо-Западный', 56.02022, 29.923969),
(612, 'Невельск', 'nevelsk', 'Сахалинская область', 'Дальневосточный', 46.652828, 141.863126),
(613, 'Невинномысск', 'nevinnomyssk', 'Ставропольский край', 'Северо-Кавказский', 44.638287, 41.936061),
(614, 'Невьянск', 'nevansk', 'Свердловская область', 'Уральский', 57.491225, 60.218251),
(615, 'Нелидово', 'nelidovo', 'Тверская область', 'Центральный', 56.223296, 32.776587),
(616, 'Неман', 'neman', 'Калининградская область', 'Северо-Западный', 55.038836, 22.028146),
(617, 'Нерехта', 'nerehta', 'Костромская область', 'Центральный', 57.454414, 40.572446),
(618, 'Нерчинск', 'nercinsk', 'Забайкальский край', 'Сибирский', 51.95948, 116.585415),
(619, 'Нерюнгри', 'nerungri', 'Якутия', 'Дальневосточный', 56.659948, 124.720315),
(620, 'Нестеров', 'nesterov', 'Калининградская область', 'Северо-Западный', 54.631368, 22.571357),
(621, 'Нефтегорск', 'neftegorsk', 'Самарская область', 'Приволжский', 52.797221, 51.163799),
(622, 'Нефтекамск', 'neftekamsk', 'Башкортостан', 'Приволжский', 56.088408, 54.248236),
(623, 'Нефтекумск', 'neftekumsk', 'Ставропольский край', 'Северо-Кавказский', 44.750586, 44.994088),
(624, 'Нефтеюганск', 'nefteugansk', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.088212, 72.616331),
(625, 'Нея', 'nea', 'Костромская область', 'Центральный', 58.294389, 43.878192),
(626, 'Нижневартовск', 'niznevartovsk', 'Ханты-Мансийский АО — Югра', 'Уральский', 60.939716, 76.569628),
(627, 'Нижнекамск', 'niznekamsk', 'Татарстан', 'Приволжский', 55.63407, 51.809112),
(628, 'Нижнеудинск', 'nizneudinsk', 'Иркутская область', 'Сибирский', 54.901233, 99.026387),
(629, 'НижниеСерги', 'nizniesergi', 'Свердловская область', 'Уральский', 54.901233, 99.026387),
(630, 'НижнийЛомов', 'niznijlomov', 'Пензенская область', 'Приволжский', 54.901233, 99.026387),
(631, 'НижнийНовгород', 'niznijnovgorod', 'Нижегородская область', 'Приволжский', 54.901233, 99.026387),
(632, 'НижнийТагил', 'niznijtagil', 'Свердловская область', 'Уральский', 54.901233, 99.026387),
(633, 'НижняяСалда', 'niznaasalda', 'Свердловская область', 'Уральский', 54.901233, 99.026387),
(634, 'НижняяТура', 'niznaatura', 'Свердловская область', 'Уральский', 54.901233, 99.026387),
(635, 'Николаевск', 'nikolaevsk', 'Волгоградская область', 'Южный', 50.025878, 45.45911),
(636, 'Николаевск-на-Амуре', 'nikolaevsk-na-amure', 'Хабаровский край', 'Дальневосточный', 53.146143, 140.711046),
(637, 'Никольск', 'nikolsk', 'Вологодская область', 'Северо-Западный', 53.71447, 46.084356),
(638, 'Никольск', 'nikolsk', 'Пензенская область', 'Приволжский', 53.71447, 46.084356),
(639, 'Никольское', 'nikolskoe', 'Ленинградская область', 'Северо-Западный', 59.704642, 30.788966),
(640, 'НоваяЛадога', 'novaaladoga', 'Ленинградская область', 'Северо-Западный', 59.704642, 30.788966),
(641, 'НоваяЛяля', 'novaalala', 'Свердловская область', 'Уральский', 59.704642, 30.788966),
(642, 'Новоалександровск', 'novoaleksandrovsk', 'Ставропольский край', 'Северо-Кавказский', 45.493304, 41.215388),
(643, 'Новоалтайск', 'novoaltajsk', 'Алтайский край', 'Сибирский', 53.412021, 83.93107),
(644, 'Новоаннинский', 'novoanninskij', 'Волгоградская область', 'Южный', 50.529658, 42.66667),
(645, 'Нововоронеж', 'novovoronez', 'Воронежская область', 'Центральный', 51.309213, 39.216277),
(646, 'Новодвинск', 'novodvinsk', 'Архангельская область', 'Северо-Западный', 64.413683, 40.820821),
(647, 'Новозыбков', 'novozybkov', 'Брянская область', 'Центральный', 52.536717, 31.933222),
(648, 'Новокубанск', 'novokubansk', 'Краснодарский край', 'Южный', 45.103812, 41.047493),
(649, 'Новокузнецк', 'novokuzneck', 'Кемеровская область', 'Сибирский', 53.757547, 87.136044),
(650, 'Новокуйбышевск', 'novokujbysevsk', 'Самарская область', 'Приволжский', 53.099469, 49.947767),
(651, 'Новомичуринск', 'novomicurinsk', 'Рязанская область', 'Центральный', 54.034574, 39.750865),
(652, 'Новомосковск', 'novomoskovsk', 'Тульская область', 'Центральный', 54.010993, 38.290896),
(653, 'Новопавловск', 'novopavlovsk', 'Ставропольский край', 'Северо-Кавказский', 43.957369, 43.631901),
(654, 'Новоржев', 'novorzev', 'Псковская область', 'Северо-Западный', 57.029623, 29.332419),
(655, 'Новороссийск', 'novorossijsk', 'Краснодарский край', 'Южный', 44.723912, 37.768974),
(656, 'Новосибирск', 'novosibirsk', 'Новосибирская область', 'Сибирский', 55.030199, 82.92043),
(657, 'Новосиль', 'novosil', 'Орловская область', 'Центральный', 52.974633, 37.043756),
(658, 'Новосокольники', 'novosokolniki', 'Псковская область', 'Северо-Западный', 56.340749, 30.152761),
(659, 'Новотроицк', 'novotroick', 'Оренбургская область', 'Приволжский', 51.196417, 58.301767),
(660, 'Новоузенск', 'novouzensk', 'Саратовская область', 'Приволжский', 50.466326, 48.132119),
(661, 'Новоульяновск', 'novoulanovsk', 'Ульяновская область', 'Приволжский', 54.151718, 48.384824),
(662, 'Новоуральск', 'novouralsk', 'Свердловская область', 'Уральский', 57.247235, 60.095604),
(663, 'Новохопёрск', 'novohopersk', 'Воронежская область', 'Центральный', 51.100286, 41.631452),
(664, 'Новочебоксарск', 'novoceboksarsk', 'Чувашия', 'Приволжский', 56.109551, 47.479125),
(665, 'Новочеркасск', 'novocerkassk', 'Ростовская область', 'Южный', 47.422052, 40.093725),
(666, 'Новошахтинск', 'novosahtinsk', 'Ростовская область', 'Южный', 47.757738, 39.93643),
(667, 'НовыйОскол', 'novyjoskol', 'Белгородская область', 'Центральный', 47.757738, 39.93643),
(668, 'НовыйУренгой', 'novyjurengoj', 'Ямало-Ненецкий АО', 'Уральский', 47.757738, 39.93643),
(669, 'Ногинск', 'noginsk', 'Московская область', 'Центральный', 55.854522, 38.441831),
(670, 'Нолинск', 'nolinsk', 'Кировская область', 'Приволжский', 57.559708, 49.935712),
(671, 'Норильск', 'norilsk', 'Красноярский край', 'Сибирский', 69.349033, 88.201176),
(672, 'Ноябрьск', 'noabrsk', 'Ямало-Ненецкий АО', 'Уральский', 63.201801, 75.450938),
(673, 'Нурлат', 'nurlat', 'Татарстан', 'Приволжский', 54.428117, 50.804958),
(674, 'Нытва', 'nytva', 'Пермский край', 'Приволжский', 57.939127, 55.328622),
(675, 'Нюрба', 'nurba', 'Якутия', 'Дальневосточный', 63.278463, 118.336617),
(676, 'Нягань', 'nagan', 'Ханты-Мансийский АО — Югра', 'Уральский', 62.145759, 65.433654),
(677, 'Нязепетровск', 'nazepetrovsk', 'Челябинская область', 'Уральский', 56.053673, 59.609678),
(678, 'Няндома', 'nandoma', 'Архангельская область', 'Северо-Западный', 61.669822, 40.204388),
(679, 'Облучье', 'obluce', 'Еврейская АО', 'Дальневосточный', 49.018898, 131.053914),
(680, 'Обнинск', 'obninsk', 'Калужская область', 'Центральный', 55.11201, 36.586531),
(681, 'Обоянь', 'oboan', 'Курская область', 'Центральный', 51.20995, 36.26744),
(682, 'Обь', 'ob', 'Новосибирская область', 'Сибирский', 54.994594, 82.693758),
(683, 'Одинцово', 'odincovo', 'Московская область', 'Центральный', 55.678859, 37.263986),
(684, 'Озёрск', 'ozersk', 'Калининградская область', 'Северо-Западный', 55.763184, 60.707599),
(685, 'Озёрск', 'ozersk', 'Челябинская область', 'Уральский', 55.763184, 60.707599),
(686, 'Озёры', 'ozery', 'Московская область', 'Центральный', 54.854087, 38.559824),
(687, 'Октябрьск', 'oktabrsk', 'Самарская область', 'Приволжский', 53.164038, 48.670668),
(688, 'Октябрьский', 'oktabrskij', 'Башкортостан', 'Приволжский', 54.481448, 53.46557),
(689, 'Окуловка', 'okulovka', 'Новгородская область', 'Северо-Западный', 58.377145, 33.298679),
(690, 'Олёкминск', 'olekminsk', 'Якутия', 'Дальневосточный', 60.375796, 120.406013),
(691, 'Оленегорск', 'olenegorsk', 'Мурманская область', 'Северо-Западный', 68.142161, 33.26696),
(692, 'Олонец', 'olonec', 'Карелия', 'Северо-Западный', 60.979719, 32.972034),
(693, 'Омск', 'omsk', 'Омская область', 'Сибирский', 54.989342, 73.368212),
(694, 'Омутнинск', 'omutninsk', 'Кировская область', 'Приволжский', 58.66406, 52.177152),
(695, 'Онега', 'onega', 'Архангельская область', 'Северо-Западный', 63.914485, 38.086646),
(696, 'Опочка', 'opocka', 'Псковская область', 'Северо-Западный', 56.714151, 28.658881),
(697, 'Орёл', 'orel', 'Орловская область', 'Центральный', 52.970371, 36.063837),
(698, 'Оренбург', 'orenburg', 'Оренбургская область', 'Приволжский', 51.768199, 55.096955),
(699, 'Орехово-Зуево', 'orehovo-zuevo', 'Московская область', 'Центральный', 55.805837, 38.981592),
(700, 'Орск', 'orsk', 'Оренбургская область', 'Приволжский', 51.229362, 58.475196),
(701, 'Оса', 'osa', 'Пермский край', 'Приволжский', 57.279672, 55.468723),
(702, 'Осинники', 'osinniki', 'Кемеровская область', 'Сибирский', 53.598748, 87.337069),
(703, 'Осташков', 'ostaskov', 'Тверская область', 'Центральный', 57.142872, 33.115441),
(704, 'Остров', 'ostrov', 'Псковская область', 'Северо-Западный', 57.345188, 28.343806),
(705, 'Островной', 'ostrovnoj', 'Мурманская область', 'Северо-Западный', 68.05439, 39.514105),
(706, 'Острогожск', 'ostrogozsk', 'Воронежская область', 'Центральный', 50.860139, 39.082365),
(707, 'Отрадное', 'otradnoe', 'Ленинградская область', 'Северо-Западный', 51.666104, 39.33658),
(708, 'Отрадный', 'otradnyj', 'Самарская область', 'Приволжский', 51.691727, 39.21793),
(709, 'Оха', 'oha', 'Сахалинская область', 'Дальневосточный', 53.584521, 142.947186),
(710, 'Оханск', 'ohansk', 'Пермский край', 'Приволжский', 57.72193, 55.388656),
(711, 'Очёр', 'ocer', 'Пермский край', 'Приволжский', 57.886894, 54.715602),
(712, 'Павлово', 'pavlovo', 'Нижегородская область', 'Приволжский', 55.964629, 43.06457),
(713, 'Павловск', 'pavlovsk', 'Воронежская область', 'Центральный', 59.686411, 30.431598),
(714, 'ПавловскийПосад', 'pavlovskijposad', 'Московская область', 'Центральный', 59.686411, 30.431598),
(715, 'Палласовка', 'pallasovka', 'Волгоградская область', 'Южный', 50.050167, 46.880398),
(716, 'Партизанск', 'partizansk', 'Приморский край', 'Дальневосточный', 43.119813, 133.123246),
(717, 'Певек', 'pevek', 'Чукотский АО', 'Дальневосточный', 69.701761, 170.299935),
(718, 'Пенза', 'penza', 'Пензенская область', 'Приволжский', 53.195063, 45.018316),
(719, 'Первомайск', 'pervomajsk', 'Нижегородская область', 'Приволжский', 54.867632, 43.801377),
(720, 'Первоуральск', 'pervouralsk', 'Свердловская область', 'Уральский', 56.905839, 59.943249),
(721, 'Перевоз', 'perevoz', 'Нижегородская область', 'Приволжский', 55.596849, 44.544931),
(722, 'Переславль-Залесский', 'pereslavl-zalesskij', 'Ярославская область', 'Центральный', 56.736093, 38.85431),
(723, 'Пермь', 'perm', 'Пермский край', 'Приволжский', 58.010374, 56.229398),
(724, 'Пестово', 'pestovo', 'Новгородская область', 'Северо-Западный', 58.599071, 35.798098),
(725, 'ПетровВал', 'petrovval', 'Волгоградская область', 'Южный', 58.599071, 35.798098),
(726, 'Петровск', 'petrovsk', 'Саратовская область', 'Приволжский', 52.314023, 45.389931),
(727, 'Петровск-Забайкальский', 'petrovsk-zabajkalskij', 'Забайкальский край', 'Сибирский', 51.274889, 108.846689),
(728, 'Петрозаводск', 'petrozavodsk', 'Карелия', 'Северо-Западный', 61.785017, 34.346878),
(729, 'Петропавловск-Камчатский', 'petropavlovsk-kamcatskij', 'Камчатский край', 'Дальневосточный', 53.024075, 158.643566),
(730, 'Петухово', 'petuhovo', 'Курганская область', 'Уральский', 55.065035, 67.887375),
(731, 'Петушки', 'petuski', 'Владимирская область', 'Центральный', 55.930967, 39.4599),
(732, 'Печора', 'pecora', 'Коми', 'Северо-Западный', 65.148602, 57.223977),
(733, 'Печоры', 'pecory', 'Псковская область', 'Северо-Западный', 57.813934, 27.609064),
(734, 'Пикалёво', 'pikalevo', 'Ленинградская область', 'Северо-Западный', 59.513113, 34.177303),
(735, 'Пионерский', 'pionerskij', 'Калининградская область', 'Северо-Западный', 54.949482, 20.224841),
(736, 'Питкяранта', 'pitkaranta', 'Карелия', 'Северо-Западный', 61.573083, 31.471254),
(737, 'Плавск', 'plavsk', 'Тульская область', 'Центральный', 53.706843, 37.291987),
(738, 'Плёс', 'ples', 'Ивановская область', 'Центральный', 57.460578, 41.512254),
(739, 'Поворино', 'povorino', 'Воронежская область', 'Центральный', 51.190773, 42.245576),
(740, 'Подольск', 'podolsk', 'Московская область', 'Центральный', 55.431177, 37.544737),
(741, 'Подпорожье', 'podporoze', 'Ленинградская область', 'Северо-Западный', 60.912784, 34.156813),
(742, 'Покачи', 'pokaci', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.742253, 75.59412),
(743, 'Покров', 'pokrov', 'Владимирская область', 'Центральный', 55.916633, 39.173374),
(744, 'Покровск', 'pokrovsk', 'Якутия', 'Дальневосточный', 61.48424, 129.148219),
(745, 'Полевской', 'polevskoj', 'Свердловская область', 'Уральский', 56.446499, 60.177072),
(746, 'Полесск', 'polessk', 'Калининградская область', 'Северо-Западный', 54.862777, 21.109879),
(747, 'Полысаево', 'polysaevo', 'Кемеровская область', 'Сибирский', 54.605443, 86.280901),
(748, 'ПолярныеЗори', 'polarnyezori', 'Мурманская область', 'Северо-Западный', 54.605443, 86.280901),
(749, 'Полярный', 'polarnyj', 'Мурманская область', 'Северо-Западный', 69.198909, 33.451033),
(750, 'Поронайск', 'poronajsk', 'Сахалинская область', 'Дальневосточный', 49.22038, 143.08956),
(751, 'Порхов', 'porhov', 'Псковская область', 'Северо-Западный', 57.764855, 29.553145),
(752, 'Похвистнево', 'pohvistnevo', 'Самарская область', 'Приволжский', 53.653282, 52.122346),
(753, 'Почеп', 'pocep', 'Брянская область', 'Центральный', 52.92913, 33.454267),
(754, 'Починок', 'pocinok', 'Смоленская область', 'Центральный', 54.406265, 32.439782),
(755, 'Пошехонье', 'posehone', 'Ярославская область', 'Центральный', 58.503749, 39.12005),
(756, 'Правдинск', 'pravdinsk', 'Калининградская область', 'Северо-Западный', 54.44634, 21.018817),
(757, 'Приволжск', 'privolzsk', 'Ивановская область', 'Центральный', 57.380662, 41.28083),
(758, 'Приморск', 'primorsk', 'Калининградская область', 'Северо-Западный', 60.366014, 28.613552),
(759, 'Приморск', 'primorsk', 'Ленинградская область', 'Северо-Западный', 60.366014, 28.613552),
(760, 'Приморско-Ахтарск', 'primorsko-ahtarsk', 'Краснодарский край', 'Южный', 46.043502, 38.177645),
(761, 'Приозерск', 'priozersk', 'Ленинградская область', 'Северо-Западный', 61.036554, 30.119838),
(762, 'Прокопьевск', 'prokopevsk', 'Кемеровская область', 'Сибирский', 53.884487, 86.750055),
(763, 'Пролетарск', 'proletarsk', 'Ростовская область', 'Южный', 46.703849, 41.727544),
(764, 'Протвино', 'protvino', 'Московская область', 'Центральный', 54.870621, 37.218316),
(765, 'Прохладный', 'prohladnyj', 'Кабардино-Балкария', 'Северо-Кавказский', 43.758962, 44.010083),
(766, 'Псков', 'pskov', 'Псковская область', 'Северо-Западный', 57.81925, 28.332065),
(767, 'Пугачёв', 'pugacev', 'Саратовская область', 'Приволжский', 52.014871, 48.795588),
(768, 'Пудож', 'pudoz', 'Карелия', 'Северо-Западный', 61.80589, 36.533),
(769, 'Пустошка', 'pustoska', 'Псковская область', 'Северо-Западный', 56.337526, 29.36678),
(770, 'Пучеж', 'pucez', 'Ивановская область', 'Центральный', 56.982087, 43.168406),
(771, 'Пушкино', 'puskino', 'Московская область', 'Центральный', 56.010428, 37.847155),
(772, 'Пущино', 'pusino', 'Московская область', 'Центральный', 54.832479, 37.620977),
(773, 'Пыталово', 'pytalovo', 'Псковская область', 'Северо-Западный', 57.063925, 27.92396),
(774, 'Пыть-Ях', 'pyt-ah', 'Ханты-Мансийский АО — Югра', 'Уральский', 60.758589, 72.836526),
(775, 'Пятигорск', 'patigorsk', 'Ставропольский край', 'Северо-Кавказский', 44.03929, 43.07084),
(776, 'Радужный', 'raduznyj', 'Владимирская область', 'Центральный', 62.134265, 77.458439),
(777, 'Радужный', 'raduznyj', 'Ханты-Мансийский АО — Югра', 'Уральский', 62.134265, 77.458439),
(778, 'Райчихинск', 'rajcihinsk', 'Амурская область', 'Дальневосточный', 49.794114, 129.411255),
(779, 'Раменское', 'ramenskoe', 'Московская область', 'Центральный', 55.567326, 38.22584),
(780, 'Рассказово', 'rasskazovo', 'Тамбовская область', 'Центральный', 52.653842, 41.874302),
(781, 'Ревда', 'revda', 'Свердловская область', 'Уральский', 56.800079, 59.908718),
(782, 'Реж', 'rez', 'Свердловская область', 'Уральский', 57.373772, 61.391639),
(783, 'Реутов', 'reutov', 'Московская область', 'Центральный', 55.760515, 37.855141),
(784, 'Ржев', 'rzev', 'Тверская область', 'Центральный', 56.262877, 34.329065),
(785, 'Родники', 'rodniki', 'Ивановская область', 'Центральный', 57.107152, 41.733366),
(786, 'Рославль', 'roslavl', 'Смоленская область', 'Центральный', 53.947309, 32.85678),
(787, 'Россошь', 'rossos', 'Воронежская область', 'Центральный', 50.192899, 39.57652),
(788, 'Ростов-на-Дону', 'rostov-na-donu', 'Ростовская область', 'Южный', 47.222078, 39.720349),
(789, 'Ростов', 'rostov', 'Ярославская область', 'Центральный', 47.222078, 39.720349),
(790, 'Рошаль', 'rosal', 'Московская область', 'Центральный', 55.663283, 39.862759),
(791, 'Ртищево', 'rtisevo', 'Саратовская область', 'Приволжский', 52.257455, 43.785657),
(792, 'Рубцовск', 'rubcovsk', 'Алтайский край', 'Сибирский', 51.501207, 81.2078),
(793, 'Рудня', 'rudna', 'Смоленская область', 'Центральный', 54.947031, 31.093576),
(794, 'Руза', 'ruza', 'Московская область', 'Центральный', 55.701516, 36.195997),
(795, 'Рузаевка', 'ruzaevka', 'Мордовия', 'Приволжский', 54.058268, 44.94911),
(796, 'Рыбинск', 'rybinsk', 'Ярославская область', 'Центральный', 58.048454, 38.858406),
(797, 'Рыбное', 'rybnoe', 'Рязанская область', 'Центральный', 54.730806, 39.505463),
(798, 'Рыльск', 'rylsk', 'Курская область', 'Центральный', 51.571431, 34.683288),
(799, 'Ряжск', 'razsk', 'Рязанская область', 'Центральный', 53.708949, 40.062894),
(800, 'Рязань', 'razan', 'Рязанская область', 'Центральный', 54.629216, 39.736375),
(801, 'Салават', 'salavat', 'Башкортостан', 'Приволжский', 53.361651, 55.924672),
(802, 'Салаир', 'salair', 'Кемеровская область', 'Сибирский', 54.235127, 85.803007),
(803, 'Салехард', 'salehard', 'Ямало-Ненецкий АО', 'Уральский', 66.529844, 66.614399),
(804, 'Сальск', 'salsk', 'Ростовская область', 'Южный', 46.475177, 41.541135),
(805, 'Самара', 'samara', 'Самарская область', 'Приволжский', 53.195538, 50.101783),
(806, 'Санкт-Петербург', 'sankt-peterburg', 'Санкт-Петербург', 'Северо-Западный', 59.939095, 30.315868),
(807, 'Саранск', 'saransk', 'Мордовия', 'Приволжский', 54.187433, 45.183938),
(808, 'Сарапул', 'sarapul', 'Удмуртия', 'Приволжский', 56.461621, 53.803678),
(809, 'Саратов', 'saratov', 'Саратовская область', 'Приволжский', 51.533103, 46.034158),
(810, 'Саров', 'sarov', 'Нижегородская область', 'Приволжский', 54.922788, 43.344844),
(811, 'Сасово', 'sasovo', 'Рязанская область', 'Центральный', 54.349928, 41.924087),
(812, 'Сатка', 'satka', 'Челябинская область', 'Уральский', 55.040492, 59.028881),
(813, 'Сафоново', 'safonovo', 'Смоленская область', 'Центральный', 55.106304, 33.237917),
(814, 'Саяногорск', 'saanogorsk', 'Хакасия', 'Сибирский', 53.100762, 91.412195),
(815, 'Саянск', 'saansk', 'Иркутская область', 'Сибирский', 53.139472, 91.4792),
(816, 'Светлогорск', 'svetlogorsk', 'Калининградская область', 'Северо-Западный', 54.944006, 20.151512),
(817, 'Светлоград', 'svetlograd', 'Ставропольский край', 'Северо-Кавказский', 45.328573, 42.856628),
(818, 'Светлый', 'svetlyj', 'Калининградская область', 'Северо-Западный', 54.67737, 20.135719),
(819, 'Светогорск', 'svetogorsk', 'Ленинградская область', 'Северо-Западный', 61.111193, 28.87268),
(820, 'Свирск', 'svirsk', 'Иркутская область', 'Сибирский', 53.066567, 103.342244),
(821, 'Свободный', 'svobodnyj', 'Амурская область', 'Дальневосточный', 51.375889, 128.134147),
(822, 'Себеж', 'sebez', 'Псковская область', 'Северо-Западный', 56.277398, 28.484814),
(823, 'Северо-Курильск', 'severo-kurilsk', 'Сахалинская область', 'Дальневосточный', 50.676327, 156.124106),
(824, 'Северобайкальск', 'severobajkalsk', 'Бурятия', 'Сибирский', 55.635996, 109.335597),
(825, 'Северодвинск', 'severodvinsk', 'Архангельская область', 'Северо-Западный', 64.562501, 39.818175),
(826, 'Североморск', 'severomorsk', 'Мурманская область', 'Северо-Западный', 69.076153, 33.416215),
(827, 'Североуральск', 'severouralsk', 'Свердловская область', 'Уральский', 60.153281, 59.952556),
(828, 'Северск', 'seversk', 'Томская область', 'Сибирский', 56.603185, 84.880913),
(829, 'Севск', 'sevsk', 'Брянская область', 'Центральный', 52.156089, 34.495091),
(830, 'Сегежа', 'segeza', 'Карелия', 'Северо-Западный', 63.743701, 34.312617),
(831, 'Сельцо', 'selco', 'Брянская область', 'Центральный', 53.373933, 34.105932),
(832, 'Семёнов', 'semenov', 'Нижегородская область', 'Приволжский', 56.789012, 44.490331),
(833, 'Семикаракорск', 'semikarakorsk', 'Ростовская область', 'Южный', 47.517792, 40.811505),
(834, 'Семилуки', 'semiluki', 'Воронежская область', 'Центральный', 51.695255, 39.018953),
(835, 'Сенгилей', 'sengilej', 'Ульяновская область', 'Приволжский', 53.96207, 48.790584),
(836, 'Серафимович', 'serafimovic', 'Волгоградская область', 'Южный', 49.584135, 42.734008),
(837, 'Сергач', 'sergac', 'Нижегородская область', 'Приволжский', 55.520105, 45.481361),
(838, 'СергиевПосад', 'sergievposad', 'Московская область', 'Центральный', 55.520105, 45.481361),
(839, 'Сердобск', 'serdobsk', 'Пензенская область', 'Приволжский', 52.455683, 44.202735),
(840, 'Серпухов', 'serpuhov', 'Московская область', 'Центральный', 54.913536, 37.416763),
(841, 'Сертолово', 'sertolovo', 'Ленинградская область', 'Северо-Западный', 60.141613, 30.211879),
(842, 'Сибай', 'sibaj', 'Башкортостан', 'Приволжский', 52.72051, 58.666429),
(843, 'Сим', 'sim', 'Челябинская область', 'Уральский', 54.990716, 57.689969),
(844, 'Сковородино', 'skovorodino', 'Амурская область', 'Дальневосточный', 53.987177, 123.943632),
(845, 'Скопин', 'skopin', 'Рязанская область', 'Центральный', 53.82359, 39.549328),
(846, 'Славгород', 'slavgorod', 'Алтайский край', 'Сибирский', 52.999375, 78.64594),
(847, 'Славск', 'slavsk', 'Калининградская область', 'Северо-Западный', 55.043819, 21.680067),
(848, 'Славянск-на-Кубани', 'slavansk-na-kubani', 'Краснодарский край', 'Южный', 45.260439, 38.126001),
(849, 'Сланцы', 'slancy', 'Ленинградская область', 'Северо-Западный', 59.11779, 28.088136),
(850, 'Слободской', 'slobodskoj', 'Кировская область', 'Приволжский', 58.731886, 50.183674),
(851, 'Слюдянка', 'sludanka', 'Иркутская область', 'Сибирский', 51.656501, 103.718845),
(852, 'Смоленск', 'smolensk', 'Смоленская область', 'Центральный', 54.782635, 32.045251),
(853, 'Снежинск', 'snezinsk', 'Челябинская область', 'Уральский', 56.085209, 60.732536),
(854, 'Снежногорск', 'sneznogorsk', 'Мурманская область', 'Северо-Западный', 69.192168, 33.238303),
(855, 'Собинка', 'sobinka', 'Владимирская область', 'Центральный', 55.993837, 40.017943),
(856, 'Советск', 'sovetsk', 'Калининградская область', 'Северо-Западный', 57.587599, 48.959521),
(857, 'Советск', 'sovetsk', 'Кировская область', 'Приволжский', 57.587599, 48.959521),
(858, 'Советск', 'sovetsk', 'Тульская область', 'Центральный', 57.587599, 48.959521),
(859, 'СоветскаяГавань', 'sovetskaagavan', 'Хабаровский край', 'Дальневосточный', 57.587599, 48.959521),
(860, 'Сокол', 'sokol', 'Вологодская область', 'Северо-Западный', 59.460968, 40.099977),
(861, 'Солигалич', 'soligalic', 'Костромская область', 'Центральный', 59.07858, 42.287815),
(862, 'Соликамск', 'solikamsk', 'Пермский край', 'Приволжский', 59.648333, 56.771029),
(863, 'Солнечногорск', 'solnecnogorsk', 'Московская область', 'Центральный', 56.185102, 36.977631),
(864, 'Соль-Илецк', 'sol-ileck', 'Оренбургская область', 'Приволжский', 51.16185, 54.980336),
(865, 'Сольвычегодск', 'solvycegodsk', 'Архангельская область', 'Северо-Западный', 61.330589, 46.928089),
(866, 'Сольцы', 'solcy', 'Новгородская область', 'Северо-Западный', 58.120168, 30.309355),
(867, 'Сорочинск', 'sorocinsk', 'Оренбургская область', 'Приволжский', 52.429092, 53.151016),
(868, 'Сорск', 'sorsk', 'Хакасия', 'Сибирский', 54.002606, 90.253323),
(869, 'Сортавала', 'sortavala', 'Карелия', 'Северо-Западный', 61.703306, 30.691723),
(870, 'Сосенский', 'sosenskij', 'Калужская область', 'Центральный', 54.059489, 35.966038),
(871, 'Сосновка', 'sosnovka', 'Кировская область', 'Приволжский', 56.253352, 51.283364),
(872, 'Сосновоборск', 'sosnovoborsk', 'Красноярский край', 'Сибирский', 56.120211, 93.335434),
(873, 'СосновыйБор', 'sosnovyjbor', 'Ленинградская область', 'Северо-Западный', 56.120211, 93.335434),
(874, 'Сосногорск', 'sosnogorsk', 'Коми', 'Северо-Западный', 63.59911, 53.876441),
(875, 'Сочи', 'soci', 'Краснодарский край', 'Южный', 43.585525, 39.723062),
(876, 'Спас-Деменск', 'spas-demensk', 'Калужская область', 'Центральный', 54.409834, 34.018948),
(877, 'Спас-Клепики', 'spas-klepiki', 'Рязанская область', 'Центральный', 55.131038, 40.175786),
(878, 'Спасск', 'spassk', 'Пензенская область', 'Приволжский', 53.926494, 43.187729),
(879, 'Спасск-Дальний', 'spassk-dalnij', 'Приморский край', 'Дальневосточный', 44.597641, 132.817559),
(880, 'Спасск-Рязанский', 'spassk-razanskij', 'Рязанская область', 'Центральный', 54.407072, 40.376424),
(881, 'Среднеколымск', 'srednekolymsk', 'Якутия', 'Дальневосточный', 67.458183, 153.707009),
(882, 'Среднеуральск', 'sredneuralsk', 'Свердловская область', 'Уральский', 56.991837, 60.477136),
(883, 'Сретенск', 'sretensk', 'Забайкальский край', 'Сибирский', 52.246252, 117.71192),
(884, 'Ставрополь', 'stavropol', 'Ставропольский край', 'Северо-Кавказский', 45.044521, 41.969083),
(885, 'СтараяКупавна', 'staraakupavna', 'Московская область', 'Центральный', 45.044521, 41.969083),
(886, 'СтараяРусса', 'staraarussa', 'Новгородская область', 'Северо-Западный', 45.044521, 41.969083),
(887, 'Старица', 'starica', 'Тверская область', 'Центральный', 56.514927, 34.933586),
(888, 'Стародуб', 'starodub', 'Брянская область', 'Центральный', 52.585277, 32.760346),
(889, 'СтарыйКрымОспаривается', 'staryjkrymosparivaetsa', 'Крым', 'Южный', 52.585277, 32.760346),
(890, 'СтарыйОскол', 'staryjoskol', 'Белгородская область', 'Центральный', 52.585277, 32.760346),
(891, 'Стерлитамак', 'sterlitamak', 'Башкортостан', 'Приволжский', 53.630403, 55.930825),
(892, 'Стрежевой', 'strezevoj', 'Томская область', 'Сибирский', 60.732862, 77.604002),
(893, 'Струнино', 'strunino', 'Владимирская область', 'Центральный', 56.37493, 38.584079),
(894, 'Ступино', 'stupino', 'Московская область', 'Центральный', 54.88688, 38.07839),
(895, 'Суворов', 'suvorov', 'Тульская область', 'Центральный', 54.122083, 36.490339),
(896, 'Суджа', 'sudza', 'Курская область', 'Центральный', 51.190953, 35.268918),
(897, 'Судогда', 'sudogda', 'Владимирская область', 'Центральный', 55.949879, 40.856295),
(898, 'Суздаль', 'suzdal', 'Владимирская область', 'Центральный', 56.419836, 40.449457),
(899, 'Сунжа', 'sunza', 'Ингушетия', 'Северо-Кавказский', 43.320353, 45.047682),
(900, 'Суоярви', 'suoarvi', 'Карелия', 'Северо-Западный', 62.087896, 32.373738),
(901, 'Сураж', 'suraz', 'Брянская область', 'Центральный', 53.013891, 32.393043),
(902, 'Сургут', 'surgut', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.254035, 73.396221),
(903, 'Суровикино', 'surovikino', 'Волгоградская область', 'Южный', 48.605493, 42.844195),
(904, 'Сурск', 'sursk', 'Пензенская область', 'Приволжский', 53.07604, 45.6911),
(905, 'Сусуман', 'susuman', 'Магаданская область', 'Дальневосточный', 62.780464, 148.153687),
(906, 'Сухиничи', 'suhinici', 'Калужская область', 'Центральный', 54.101752, 35.339319),
(907, 'СухойЛог', 'suhojlog', 'Свердловская область', 'Уральский', 54.101752, 35.339319),
(908, 'Сызрань', 'syzran', 'Самарская область', 'Приволжский', 53.155782, 48.474485),
(909, 'Сыктывкар', 'syktyvkar', 'Коми', 'Северо-Западный', 61.668793, 50.836399),
(910, 'Сысерть', 'sysert', 'Свердловская область', 'Уральский', 56.502281, 60.810025),
(911, 'Сычёвка', 'sycevka', 'Смоленская область', 'Центральный', 55.83161, 34.277834),
(912, 'Сясьстрой', 'sasstroj', 'Ленинградская область', 'Северо-Западный', 60.141954, 32.556743),
(913, 'Тавда', 'tavda', 'Свердловская область', 'Уральский', 58.041871, 65.272595),
(914, 'Таганрог', 'taganrog', 'Ростовская область', 'Южный', 47.220983, 38.9173),
(915, 'Тайга', 'tajga', 'Кемеровская область', 'Сибирский', 56.065138, 85.631024),
(916, 'Тайшет', 'tajset', 'Иркутская область', 'Сибирский', 55.940502, 98.002982),
(917, 'Талдом', 'taldom', 'Московская область', 'Центральный', 56.73084, 37.527633),
(918, 'Талица', 'talica', 'Свердловская область', 'Уральский', 56.595192, 37.661689),
(919, 'Тамбов', 'tambov', 'Тамбовская область', 'Центральный', 52.721219, 41.452274),
(920, 'Тарко-Сале', 'tarko-sale', 'Ямало-Ненецкий АО', 'Уральский', 64.911819, 77.761055),
(921, 'Таруса', 'tarusa', 'Калужская область', 'Центральный', 54.729122, 37.17959),
(922, 'Татарск', 'tatarsk', 'Новосибирская область', 'Сибирский', 55.214532, 75.97409),
(923, 'Таштагол', 'tastagol', 'Кемеровская область', 'Сибирский', 52.763912, 87.848309),
(924, 'Тверь', 'tver', 'Тверская область', 'Центральный', 56.859611, 35.911896),
(925, 'Теберда', 'teberda', 'Карачаево-Черкесия', 'Северо-Кавказский', 43.443841, 41.741423),
(926, 'Тейково', 'tejkovo', 'Ивановская область', 'Центральный', 56.85436, 40.535471),
(927, 'Темников', 'temnikov', 'Мордовия', 'Приволжский', 54.630967, 43.216089),
(928, 'Темрюк', 'temruk', 'Краснодарский край', 'Южный', 45.27841, 37.370194),
(929, 'Терек', 'terek', 'Кабардино-Балкария', 'Северо-Кавказский', 43.483865, 44.140267),
(930, 'Тетюши', 'tetusi', 'Татарстан', 'Приволжский', 54.936931, 48.830074),
(931, 'Тимашёвск', 'timasevsk', 'Краснодарский край', 'Южный', 45.61478, 38.934332),
(932, 'Тихвин', 'tihvin', 'Ленинградская область', 'Северо-Западный', 59.644209, 33.542096),
(933, 'Тихорецк', 'tihoreck', 'Краснодарский край', 'Южный', 45.85468, 40.125929),
(934, 'Тобольск', 'tobolsk', 'Тюменская область', 'Уральский', 58.201698, 68.253762),
(935, 'Тогучин', 'togucin', 'Новосибирская область', 'Сибирский', 55.238013, 84.402865),
(936, 'Тольятти', 'tolatti', 'Самарская область', 'Приволжский', 53.508816, 49.419207),
(937, 'Томари', 'tomari', 'Сахалинская область', 'Дальневосточный', 47.762214, 142.061627),
(938, 'Томмот', 'tommot', 'Якутия', 'Дальневосточный', 58.958666, 126.287579),
(939, 'Томск', 'tomsk', 'Томская область', 'Сибирский', 56.48464, 84.947649),
(940, 'Топки', 'topki', 'Кемеровская область', 'Сибирский', 55.276508, 85.615223),
(941, 'Торжок', 'torzok', 'Тверская область', 'Центральный', 57.041338, 34.96014),
(942, 'Торопец', 'toropec', 'Тверская область', 'Центральный', 56.501173, 31.635466),
(943, 'Тосно', 'tosno', 'Ленинградская область', 'Северо-Западный', 59.540664, 30.877719),
(944, 'Тотьма', 'totma', 'Вологодская область', 'Северо-Западный', 59.973487, 42.758873),
(945, 'Трёхгорный', 'trehgornyj', 'Челябинская область', 'Уральский', 54.817842, 58.446423),
(946, 'Троицк', 'troick', 'Челябинская область', 'Уральский', 54.083217, 61.559759),
(947, 'Трубчевск', 'trubcevsk', 'Брянская область', 'Центральный', 52.579077, 33.766073),
(948, 'Туапсе', 'tuapse', 'Краснодарский край', 'Южный', 44.09564, 39.073553),
(949, 'Туймазы', 'tujmazy', 'Башкортостан', 'Приволжский', 54.599988, 53.695008),
(950, 'Тула', 'tula', 'Тульская область', 'Центральный', 54.193122, 37.617348),
(951, 'Туран', 'turan', 'Тыва', 'Сибирский', 52.144916, 93.917309),
(952, 'Туринск', 'turinsk', 'Свердловская область', 'Уральский', 58.039442, 63.698144),
(953, 'Тутаев', 'tutaev', 'Ярославская область', 'Центральный', 57.8688, 39.530759),
(954, 'Тында', 'tynda', 'Амурская область', 'Дальневосточный', 55.154656, 124.729236),
(955, 'Тырныауз', 'tyrnyauz', 'Кабардино-Балкария', 'Северо-Кавказский', 43.398084, 42.921423),
(956, 'Тюкалинск', 'tukalinsk', 'Омская область', 'Сибирский', 55.870506, 72.195506),
(957, 'Тюмень', 'tumen', 'Тюменская область', 'Уральский', 57.153033, 65.534328),
(958, 'Уварово', 'uvarovo', 'Тамбовская область', 'Центральный', 51.983099, 42.261),
(959, 'Углегорск', 'uglegorsk', 'Сахалинская область', 'Дальневосточный', 49.081575, 142.069281),
(960, 'Углич', 'uglic', 'Ярославская область', 'Центральный', 57.526592, 38.319372),
(961, 'Удачный', 'udacnyj', 'Якутия', 'Дальневосточный', 66.406995, 112.306362),
(962, 'Удомля', 'udomla', 'Тверская область', 'Центральный', 57.876779, 35.00511),
(963, 'Ужур', 'uzur', 'Красноярский край', 'Сибирский', 55.320155, 89.844006),
(964, 'Узловая', 'uzlovaa', 'Тульская область', 'Центральный', 53.97844, 38.160299),
(965, 'Улан-Удэ', 'ulan-ude', 'Бурятия', 'Сибирский', 51.834464, 107.584574),
(966, 'Ульяновск', 'ulanovsk', 'Ульяновская область', 'Приволжский', 54.314192, 48.403123),
(967, 'Унеча', 'uneca', 'Брянская область', 'Центральный', 52.845115, 32.670676),
(968, 'Урай', 'uraj', 'Ханты-Мансийский АО — Югра', 'Уральский', 60.129632, 64.803944),
(969, 'Урень', 'uren', 'Нижегородская область', 'Приволжский', 57.463042, 45.799527),
(970, 'Уржум', 'urzum', 'Кировская область', 'Приволжский', 57.109738, 50.005717),
(971, 'Урус-Мартан', 'urus-martan', 'Чечня', 'Северо-Кавказский', 43.127617, 45.540614),
(972, 'Урюпинск', 'urupinsk', 'Волгоградская область', 'Южный', 50.794522, 41.995844),
(973, 'Усинск', 'usinsk', 'Коми', 'Северо-Западный', 65.994144, 57.55701),
(974, 'Усмань', 'usman', 'Липецкая область', 'Центральный', 52.043386, 39.736069),
(975, 'Усолье-Сибирское', 'usole-sibirskoe', 'Иркутская область', 'Сибирский', 52.756648, 103.638769),
(976, 'Усолье', 'usole', 'Пермский край', 'Приволжский', 52.756648, 103.638769),
(977, 'Уссурийск', 'ussurijsk', 'Приморский край', 'Дальневосточный', 43.797273, 131.95178),
(978, 'Усть-Джегута', 'ust-dzeguta', 'Карачаево-Черкесия', 'Северо-Кавказский', 44.083895, 41.971042),
(979, 'Усть-Илимск', 'ust-ilimsk', 'Иркутская область', 'Сибирский', 54.55712, 100.578038),
(980, 'Усть-Катав', 'ust-katav', 'Челябинская область', 'Уральский', 54.930289, 58.1747),
(981, 'Усть-Кут', 'ust-kut', 'Иркутская область', 'Сибирский', 56.792838, 105.775699),
(982, 'Усть-Лабинск', 'ust-labinsk', 'Краснодарский край', 'Южный', 45.213625, 39.691234),
(983, 'Устюжна', 'ustuzna', 'Вологодская область', 'Северо-Западный', 58.838391, 36.442414),
(984, 'Уфа', 'ufa', 'Башкортостан', 'Приволжский', 54.735147, 55.958727),
(985, 'Ухта', 'uhta', 'Коми', 'Северо-Западный', 63.562626, 53.684022),
(986, 'Учалы', 'ucaly', 'Башкортостан', 'Приволжский', 54.319176, 59.378631),
(987, 'Уяр', 'uar', 'Красноярский край', 'Сибирский', 55.813172, 94.328297),
(988, 'Фатеж', 'fatez', 'Курская область', 'Центральный', 52.091789, 35.853892),
(989, 'Фокино', 'fokino', 'Брянская область', 'Центральный', 53.455436, 34.415923),
(990, 'Фокино', 'fokino', 'Приморский край', 'Дальневосточный', 53.455436, 34.415923),
(991, 'Фролово', 'frolovo', 'Волгоградская область', 'Южный', 49.765861, 43.649292),
(992, 'Фрязино', 'frazino', 'Московская область', 'Центральный', 55.957938, 38.052339),
(993, 'Фурманов', 'furmanov', 'Ивановская область', 'Центральный', 57.252601, 41.106189),
(994, 'Хабаровск', 'habarovsk', 'Хабаровский край', 'Дальневосточный', 48.480223, 135.071917),
(995, 'Хадыженск', 'hadyzensk', 'Краснодарский край', 'Южный', 44.422804, 39.537326),
(996, 'Ханты-Мансийск', 'hanty-mansijsk', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.00318, 69.018902),
(997, 'Харабали', 'harabali', 'Астраханская область', 'Южный', 47.409315, 47.252058),
(998, 'Харовск', 'harovsk', 'Вологодская область', 'Северо-Западный', 59.95074, 40.20631),
(999, 'Хасавюрт', 'hasavurt', 'Дагестан', 'Северо-Кавказский', 43.246265, 46.590044),
(1000, 'Хвалынск', 'hvalynsk', 'Саратовская область', 'Приволжский', 52.495501, 48.105772),
(1001, 'Хилок', 'hilok', 'Забайкальский край', 'Сибирский', 51.363401, 110.459012),
(1002, 'Химки', 'himki', 'Московская область', 'Центральный', 55.88874, 37.43039),
(1003, 'Холм', 'holm', 'Новгородская область', 'Северо-Западный', 57.145202, 31.178781),
(1004, 'Холмск', 'holmsk', 'Сахалинская область', 'Дальневосточный', 47.040905, 142.041622),
(1005, 'Хотьково', 'hotkovo', 'Московская область', 'Центральный', 56.252182, 37.978677),
(1006, 'Цивильск', 'civilsk', 'Чувашия', 'Приволжский', 55.86501, 47.47298),
(1007, 'Цимлянск', 'cimlansk', 'Ростовская область', 'Южный', 47.647714, 42.09306),
(1008, 'Чадан', 'cadan', 'Тыва', 'Сибирский', 51.284472, 91.578913),
(1009, 'Чайковский', 'cajkovskij', 'Пермский край', 'Приволжский', 56.778061, 54.147759),
(1010, 'Чапаевск', 'capaevsk', 'Самарская область', 'Приволжский', 52.981709, 49.710217),
(1011, 'Чаплыгин', 'caplygin', 'Липецкая область', 'Центральный', 53.240555, 39.96699),
(1012, 'Чебаркуль', 'cebarkul', 'Челябинская область', 'Уральский', 54.977785, 60.37012),
(1013, 'Чебоксары', 'ceboksary', 'Чувашия', 'Приволжский', 56.146277, 47.251079),
(1014, 'Чегем', 'cegem', 'Кабардино-Балкария', 'Северо-Кавказский', 43.567114, 43.586626),
(1015, 'Чекалин', 'cekalin', 'Тульская область', 'Центральный', 54.098505, 36.247372),
(1016, 'Челябинск', 'celabinsk', 'Челябинская область', 'Уральский', 55.159897, 61.402554),
(1017, 'Чердынь', 'cerdyn', 'Пермский край', 'Приволжский', 60.402836, 56.479543),
(1018, 'Черемхово', 'ceremhovo', 'Иркутская область', 'Сибирский', 53.136911, 103.090096),
(1019, 'Черепаново', 'cerepanovo', 'Новосибирская область', 'Сибирский', 54.228417, 83.372201),
(1020, 'Череповец', 'cerepovec', 'Вологодская область', 'Северо-Западный', 59.122612, 37.903461),
(1021, 'Черкесск', 'cerkessk', 'Карачаево-Черкесия', 'Северо-Кавказский', 44.226863, 42.04677),
(1022, 'Чёрмоз', 'cermoz', 'Пермский край', 'Приволжский', 58.784335, 56.150796),
(1023, 'Черноголовка', 'cernogolovka', 'Московская область', 'Центральный', 56.010005, 38.379245),
(1024, 'Черногорск', 'cernogorsk', 'Хакасия', 'Сибирский', 53.827013, 91.306005),
(1025, 'Чернушка', 'cernuska', 'Пермский край', 'Приволжский', 56.51601, 56.076361),
(1026, 'Черняховск', 'cernahovsk', 'Калининградская область', 'Северо-Западный', 54.630706, 21.819503),
(1027, 'Чехов', 'cehov', 'Московская область', 'Центральный', 55.149851, 37.466997),
(1028, 'Чистополь', 'cistopol', 'Татарстан', 'Приволжский', 55.372334, 50.643575),
(1029, 'Чита', 'cita', 'Забайкальский край', 'Сибирский', 52.033973, 113.499432),
(1030, 'Чкаловск', 'ckalovsk', 'Нижегородская область', 'Приволжский', 56.766253, 43.251105),
(1031, 'Чудово', 'cudovo', 'Новгородская область', 'Северо-Западный', 59.12119, 31.670285),
(1032, 'Чулым', 'culym', 'Новосибирская область', 'Сибирский', 55.091258, 80.963288),
(1033, 'Чусовой', 'cusovoj', 'Пермский край', 'Приволжский', 58.297548, 57.819318),
(1034, 'Чухлома', 'cuhloma', 'Костромская область', 'Центральный', 58.753399, 42.688526),
(1035, 'Шагонар', 'sagonar', 'Тыва', 'Сибирский', 51.534705, 92.919972),
(1036, 'Шадринск', 'sadrinsk', 'Курганская область', 'Уральский', 56.087042, 63.629747),
(1037, 'Шали', 'sali', 'Чечня', 'Северо-Кавказский', 43.1488, 45.900991),
(1038, 'Шарыпово', 'sarypovo', 'Красноярский край', 'Сибирский', 55.539064, 89.180151),
(1039, 'Шарья', 'sara', 'Костромская область', 'Центральный', 58.369849, 45.518264),
(1040, 'Шахты', 'sahty', 'Ростовская область', 'Южный', 47.709601, 40.215797),
(1041, 'Шахунья', 'sahuna', 'Нижегородская область', 'Приволжский', 57.676379, 46.612915),
(1042, 'Шацк', 'sack', 'Рязанская область', 'Центральный', 51.496839, 23.930185),
(1043, 'Шебекино', 'sebekino', 'Белгородская область', 'Центральный', 50.400498, 36.887916),
(1044, 'Шелехов', 'selehov', 'Иркутская область', 'Сибирский', 52.210209, 104.097395),
(1045, 'Шенкурск', 'senkursk', 'Архангельская область', 'Северо-Западный', 62.10565, 42.899612),
(1046, 'Шимановск', 'simanovsk', 'Амурская область', 'Дальневосточный', 51.85262, 116.032735),
(1047, 'Шиханы', 'sihany', 'Саратовская область', 'Приволжский', 52.114774, 47.202327),
(1048, 'Шлиссельбург', 'slisselburg', 'Ленинградская область', 'Северо-Западный', 59.934943, 31.026597),
(1049, 'Шумерля', 'sumerla', 'Чувашия', 'Приволжский', 55.497934, 46.417846),
(1050, 'Шумиха', 'sumiha', 'Курганская область', 'Уральский', 55.228726, 63.28571),
(1051, 'Шуя', 'sua', 'Ивановская область', 'Центральный', 56.852037, 41.385556),
(1052, 'Щёкино', 'sekino', 'Тульская область', 'Центральный', 54.002146, 37.517626),
(1053, 'ЩёлкиноОспаривается', 'selkinoosparivaetsa', 'Крым', 'Южный', 45.428886, 35.825065),
(1054, 'Щёлково', 'selkovo', 'Московская область', 'Центральный', 55.920209, 37.991478),
(1055, 'Щигры', 'sigry', 'Курская область', 'Центральный', 51.87619, 36.912),
(1056, 'Щучье', 'suce', 'Курганская область', 'Уральский', 55.208831, 62.747853),
(1057, 'Электрогорск', 'elektrogorsk', 'Московская область', 'Центральный', 55.883161, 38.786209),
(1058, 'Электросталь', 'elektrostal', 'Московская область', 'Центральный', 55.784445, 38.444849),
(1059, 'Электроугли', 'elektrougli', 'Московская область', 'Центральный', 55.716859, 38.219659),
(1060, 'Элиста', 'elista', 'Калмыкия', 'Южный', 46.307743, 44.269759),
(1061, 'Энгельс', 'engels', 'Саратовская область', 'Приволжский', 51.485489, 46.126783),
(1062, 'Эртиль', 'ertil', 'Воронежская область', 'Центральный', 51.835727, 40.799243),
(1063, 'Югорск', 'ugorsk', 'Ханты-Мансийский АО — Югра', 'Уральский', 61.314917, 63.331964),
(1064, 'Южа', 'uza', 'Ивановская область', 'Центральный', 56.583698, 42.011843),
(1065, 'Южно-Сахалинск', 'uzno-sahalinsk', 'Сахалинская область', 'Дальневосточный', 46.959155, 142.738023),
(1066, 'Южно-Сухокумск', 'uzno-suhokumsk', 'Дагестан', 'Северо-Кавказский', 44.660166, 45.649966),
(1067, 'Южноуральск', 'uznouralsk', 'Челябинская область', 'Уральский', 54.442455, 61.268229),
(1068, 'Юрга', 'urga', 'Кемеровская область', 'Сибирский', 55.713557, 84.933869),
(1069, 'Юрьев-Польский', 'urev-polskij', 'Владимирская область', 'Центральный', 56.49925, 39.680814),
(1070, 'Юрьевец', 'urevec', 'Ивановская область', 'Центральный', 57.317815, 43.110995),
(1071, 'Юрюзань', 'uruzan', 'Челябинская область', 'Уральский', 54.854646, 58.422662),
(1072, 'Юхнов', 'uhnov', 'Калужская область', 'Центральный', 54.744201, 35.238878),
(1073, 'Ядрин', 'adrin', 'Чувашия', 'Приволжский', 55.940689, 46.202107),
(1074, 'Якутск', 'akutsk', 'Якутия', 'Дальневосточный', 62.028103, 129.732663),
(1075, 'Ялуторовск', 'alutorovsk', 'Тюменская область', 'Уральский', 56.654689, 66.312206),
(1076, 'Янаул', 'anaul', 'Башкортостан', 'Приволжский', 56.264957, 54.929824),
(1077, 'Яранск', 'aransk', 'Кировская область', 'Приволжский', 57.304228, 47.885855),
(1078, 'Яровое', 'arovoe', 'Алтайский край', 'Сибирский', 52.923446, 78.569601),
(1079, 'Ярославль', 'aroslavl', 'Ярославская область', 'Центральный', 57.626569, 39.893787),
(1080, 'Ярцево', 'arcevo', 'Смоленская область', 'Центральный', 57.535951, 40.006121),
(1081, 'Ясногорск', 'asnogorsk', 'Тульская область', 'Центральный', 54.479555, 37.689689),
(1082, 'Ясный', 'asnyj', 'Оренбургская область', 'Приволжский', 51.036877, 59.874349),
(1083, 'Яхрома', 'ahroma', 'Московская область', '', 56.28989, 37.483858);

-- --------------------------------------------------------

--
-- Структура таблицы `good`
--

CREATE TABLE `good` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(254) NOT NULL,
  `category_id` int(11) NOT NULL,
  `provider_id` int(10) UNSIGNED NOT NULL,
  `weight` decimal(10,2) UNSIGNED DEFAULT NULL,
  `height` decimal(10,2) UNSIGNED DEFAULT NULL,
  `width` decimal(10,2) UNSIGNED DEFAULT NULL,
  `volume` decimal(10,2) UNSIGNED DEFAULT NULL,
  `root_system` varchar(10) NOT NULL,
  `quantity` int(11) NOT NULL DEFAULT 1,
  `slug` varchar(254) NOT NULL,
  `price` int(10) UNSIGNED NOT NULL,
  `discount_price` int(10) UNSIGNED DEFAULT NULL,
  `vendor_code` varchar(254) DEFAULT NULL,
  `description` text DEFAULT NULL,
  `hash` varchar(254) NOT NULL,
  `size` varchar(254) NOT NULL,
  `minPriceForOrderCheckout` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `good`
--

INSERT INTO `good` (`id`, `name`, `category_id`, `provider_id`, `weight`, `height`, `width`, `volume`, `root_system`, `quantity`, `slug`, `price`, `discount_price`, `vendor_code`, `description`, `hash`, `size`, `minPriceForOrderCheckout`) VALUES
(1, 'Бархат амурский', 3, 4, NULL, NULL, NULL, NULL, 'ЗКС', 1, 'barhat-amurskij', 1900, NULL, 'Voodland.1-1', 'https://voodland.club/barkhat-amurskij/nez-proizvoditelyf', '030b934d4d8de2e0ff37bb41c0f06245', '120-140 см', 1),
(2, 'Барбарис обыкновенный', 5, 4, NULL, NULL, NULL, NULL, 'ЗКС', 17, 'barbaris-obyknovennyj', 300, NULL, 'Voodland.1-2', 'https://voodland.club/kustarniki/barbaris/barbaris-obyknovennyj', 'c0806adcb9ed50aeef8cf216b007a8d3', '30-70 см', 1),
(3, 'Бирючина круглолистная', 6, 4, NULL, NULL, NULL, NULL, 'ЗКС', 25, 'birucina-kruglolistnaa', 250, NULL, 'Voodland.1-3', 'https://voodland.club/kustarniki/biryuchina/biryuchina-obyknovennaya', 'ef6abdceae671b598616e04f15d5ddad', '30-60 см', 1),
(4, 'Виноград девичий', 7, 4, NULL, NULL, NULL, NULL, 'ЗКС', 60, 'vinograd-devicij', 200, NULL, 'Voodland.1-4', 'https://voodland.club/kustarniki/vinograd/vinograd-parthenocissus-quinquefolia', '71991030fff9f9c550ebb5ff4b671fdf', '30-50 см', 2),
(5, 'Гортензия древовидная анабель', 8, 4, NULL, NULL, NULL, NULL, 'ЗКС', 2, 'gortenzia-drevovidnaa-anabel', 1150, NULL, 'Voodland.1-5', 'https://voodland.club/kustarniki/gortenziya/gortenziya-drevovidnaya-annabel-annabelle', '3ab664e96590caf482dc96dbd4f24bb9', '40-50 см', 1),
(6, 'Гортензия метельчатая Ванилла Фрайз', 8, 4, NULL, NULL, NULL, NULL, 'ЗКС', 2, 'gortenzia-metelcataa-vanilla-frajz', 1550, NULL, 'Voodland.1-6', 'https://voodland.club/kustarniki/gortenziya/gortenziya-metelchataya-vanilla-frejz-vanille-fraise', 'e3442bfba3559ec39079b50f9a027029', '30-50 см', 1),
(7, 'Гортензия метельчатая Киушу', 8, 4, NULL, NULL, NULL, NULL, 'ЗКС', 4, 'gortenzia-metelcataa-kiusu', 1650, NULL, 'Voodland.1-7', 'https://voodland.club/kustarniki/gortenziya/gortenziya-metelchataya-kiushu-kyushu', '28f6dfbdfa19e183e57f272e3a8b6579', '30-60 см', 1),
(8, 'Гортензия метельчатая Пинки Винки', 8, 4, NULL, NULL, NULL, NULL, 'ЗКС', 1, 'gortenzia-metelcataa-pinki-vinki', 2600, NULL, 'Voodland.1-8', 'https://voodland.club/kustarniki/gortenziya/gortenziya-metelchataya-pinki-vinki-pinky-winky', 'eaf2de43a5b959b04bc1634924dc0b32', '40-70 см', 1),
(9, 'Гортензия метельчатая Грандифлора', 8, 4, NULL, NULL, NULL, NULL, 'ЗКС', 2, 'gortenzia-metelcataa-grandiflora', 1500, NULL, 'Voodland.1-9', 'https://voodland.club/kustarniki/gortenziya/gortenziya-metelchataya-grandiflora-grandiflora', 'cf7783100d9d9e5a16a9a7ed71089661', '30-40 см', 1),
(10, 'Дуб черешчатый', 9, 4, NULL, NULL, NULL, NULL, 'ЗКС', 45, 'dub-cerescatyj', 220, NULL, 'Voodland.1-10', 'https://voodland.club/derevya/dub/dub-chereshchatyj', '3ecca7bd56fc3b0c165902909bbac27d', '30-50 см', 1),
(11, 'Жимолость татарская', 10, 4, NULL, NULL, NULL, NULL, 'ЗКС', 140, 'zimolost-tatarskaa', 230, NULL, 'Voodland.1-11', 'https://voodland.club/kustarniki/zhimolost/zhimolost-tatarskaya-tatarica', 'ab87ddefe0c669ce50f92badb3c4f3bb', '20-40 см', 5),
(12, 'Ива цельнолистная Хакуро Нишики', 11, 4, NULL, NULL, NULL, NULL, 'ЗКС', 3, 'iva-celnolistnaa-hakuro-nisiki', 400, NULL, 'Voodland.1-12', 'https://voodland.club/derevya/iva/iva-integra-hakuro-nishiki-na-shtambe', '66b78523ccb2c2d3aa568f94dcfe062a', '50-70 см', 1),
(13, 'Опунция', 13, 4, NULL, NULL, NULL, NULL, 'ЗКС', 15, 'opuncia', 500, NULL, 'Voodland.1-13', 'https://voodland.club/kaktusy/opuntsiya/kaktus-opuntsiya', '75f955b07291598d2b976e3aba605720', '15-20 см', 1),
(14, 'Катальпа прекрасная', 14, 4, NULL, NULL, NULL, NULL, 'ЗКС', 2, 'katalpa-prekrasnaa', 450, NULL, 'Voodland.1-14', 'https://voodland.club/derevya/katalpa/katalpa', '5c0bb078960955f6822f614198cdb76a', '50-70 см', 1),
(15, 'Каштан конский', 15, 4, NULL, NULL, NULL, NULL, 'ЗКС', 3, 'kastan-konskij', 450, NULL, 'Voodland.1-15', 'https://voodland.club/derevya/kashtan/kashtan-konskij', '6fdf9b4d3b25da485f4a39e735fe4ae1', '40-60 см', 1),
(16, 'Кизильник блестящий', 16, 4, NULL, NULL, NULL, NULL, 'ЗКС', 100, 'kizilnik-blestasij', 230, NULL, 'Voodland.1-16', 'https://voodland.club/kustarniki/kizilnik/kizilnik-blestyashchij', 'f1ad426c1c549ca4d5b8dfee7b253340', '30-50 см', 1),
(17, 'Можжевельник скальный Блю Арроу', 18, 4, NULL, NULL, NULL, NULL, 'ЗКС', 50, 'mozzevelnik-skalnyj-blu-arrou', 350, NULL, 'Voodland.1-17', 'https://voodland.club/khvojnye-rasteniya/mozhzhevelnik/mozhzhevelnik-blue-arrow', 'c31e09538aa29629518d1a06020cbac2', '20-30 см', 1),
(18, 'Можжевельник казацкий', 18, 4, NULL, NULL, NULL, NULL, 'ЗКС', 3, 'mozzevelnik-kazackij', 700, NULL, 'Voodland.1-18', 'https://voodland.club/khvojnye-rasteniya/mozhzhevelnik/mojjev-srednij/mojjev-sred-raskidisty/mozhzhevelnik-kazatskij', '0037b58731d9041b7ae8794a6f0c7043', '40-50 см', 1),
(19, 'Орех грецкий скороплодный Левина (сеянцы) 1-но летние', 20, 4, NULL, NULL, NULL, NULL, 'ЗКС', 20, 'oreh-greckij-skoroplodnyj-levina-seancy-1-no-letnie', 450, NULL, 'Voodland.1-19', 'https://voodland.club/plodovye/orekh/orekh-gretskij-kustovoj-levina', '22cc89547e67c526024263809e6092c5', '10-20 см', 1),
(20, 'Орех грецкий скороплодный Левина (сеянцы) 2-х летние', 20, 4, NULL, NULL, NULL, NULL, 'ЗКС', 10, 'oreh-greckij-skoroplodnyj-levina-seancy-2-h-letnie', 800, NULL, 'Voodland.1-20', 'https://voodland.club/plodovye/orekh/orekh-gretskij-kustovoj-levina', 'b8d7f465616b136cde5d64c81850428a', '20-40 см', 1),
(21, 'Орех ланкастерский 1-но летние (сеянцы)', 20, 4, NULL, NULL, NULL, NULL, 'ЗКС', 10, 'oreh-lankasterskij-1-no-letnie-seancy', 400, NULL, 'Voodland.1-21', 'https://voodland.club/plodovye/orekh/orekh-lancasterskii', '358c858e690ed39a4392871c8f6e84ca', '20-30 см', 1),
(22, 'Орех ланкастерский 3-х летние (сеянцы)', 20, 4, NULL, NULL, NULL, NULL, 'ЗКС', 4, 'oreh-lankasterskij-3-h-letnie-seancy', 1100, NULL, 'Voodland.1-22', 'https://voodland.club/plodovye/orekh/orekh-lancasterskii', 'edbf791765eac459ff34a61d4c9ef921', '40-60 см', 1),
(23, 'Персик волгоградский поздний (сеянцы)', 21, 4, NULL, NULL, NULL, NULL, 'ЗКС', 70, 'persik-volgogradskij-pozdnij-seancy', 280, NULL, 'Voodland.1-23', 'https://voodland.club/plodovye/persik-kievskij-rannij776031', 'ba122874746ef65810ae8e3b1f6d7917', '40-70 см', 1),
(24, 'Персик донецкий белый (сеянцы)', 21, 4, NULL, NULL, NULL, NULL, 'ЗКС', 60, 'persik-doneckij-belyj-seancy', 260, NULL, 'Voodland.1-24', 'https://voodland.club/plodovye/persik/persik-donetskij', 'e7187dd86de7e156e044fcb9399a7a1b', '30-50 см', 1),
(25, 'Спирея японская Фробели', 22, 4, NULL, NULL, NULL, NULL, 'ЗКС', 40, 'spirea-aponskaa-frobeli', 420, NULL, 'Voodland.1-25', 'https://voodland.club/kustarniki/spireya/spireya-yaponskaya-frobeli-froebelii', '92c26179d75688dc5d03d71eb3157abf', '30-50 см', 1),
(26, 'Спирея Бумальда', 22, 4, NULL, NULL, NULL, NULL, 'ЗКС', 15, 'spirea-bumalda', 450, NULL, 'Voodland.1-26', 'https://voodland.club/kustarniki/spireya/spireya-bumalda', '1c818491c0585f44e05310c41cc4b7ed', '30-50 см', 1),
(27, 'Сумах оленерогий', 23, 4, NULL, NULL, NULL, NULL, 'ЗКС', 10, 'sumah-olenerogij', 500, NULL, 'Voodland.1-27', 'https://voodland.club/derevya/sumakh/sumakh', '0db81005dff9a3414fd2548ebf3d128f', '60-80 см', 1),
(28, 'Самшит', 24, 4, NULL, NULL, NULL, NULL, 'ЗКС', 30, 'samsit', 300, NULL, 'Voodland.1-28', 'https://voodland.club/kustarniki/samshit/samshit-100', 'abc75d25e759e26bd10aa4a52e39d149', '20-30 см', 1),
(29, 'Яблоня Хоней Крисп', 25, 4, NULL, NULL, NULL, NULL, 'ЗКС', 3, 'ablona-honej-krisp', 900, NULL, 'Voodland.1-29', 'https://voodland.club/plodovye/yablonya1/zimnie-sorta/yablonya-khani-krisp', '96804af39595653e907c48ca86286230', '130-150 см', 1),
(30, 'Яблоня Мекинтош', 25, 4, NULL, NULL, NULL, NULL, 'ЗКС', 4, 'ablona-mekintos', 800, NULL, 'Voodland.1-30', 'описание будет в ближайшее время', '56b4936a9fb31ba55d6a533284eb5b3b', '130-150 см', 1),
(31, 'Яблоня Эрли Женева', 25, 4, NULL, NULL, NULL, NULL, 'ЗКС', 3, 'ablona-erli-zeneva', 800, NULL, 'Voodland.1-31', 'https://voodland.club/plodovye/yablonya1/yablonya-erli-zheneva', 'f0e85e2e24e88f95ac70c85fe1f11abe', '130-150 см', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `good_category`
--

CREATE TABLE `good_category` (
  `category_id` int(10) UNSIGNED NOT NULL,
  `good_id` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `migration`
--

CREATE TABLE `migration` (
  `version` varchar(180) NOT NULL,
  `apply_time` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `migration`
--

INSERT INTO `migration` (`version`, `apply_time`) VALUES
('m000000_000000_base', 1619031712),
('m130524_201442_init', 1619031714),
('m180604_202836_create_cart_items_table', 1620444074),
('m190124_110200_add_verification_token_column_to_user_table', 1619031714);

-- --------------------------------------------------------

--
-- Структура таблицы `order_checkout`
--

CREATE TABLE `order_checkout` (
  `id` int(10) UNSIGNED NOT NULL,
  `user_id` int(10) UNSIGNED NOT NULL,
  `discount_price` decimal(10,0) UNSIGNED NOT NULL,
  `delivery_price` decimal(10,0) UNSIGNED NOT NULL,
  `total_price` decimal(10,0) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `order_checkout`
--

INSERT INTO `order_checkout` (`id`, `user_id`, `discount_price`, `delivery_price`, `total_price`) VALUES
(1, 1, '123', '2153', '213');

-- --------------------------------------------------------

--
-- Структура таблицы `order_item`
--

CREATE TABLE `order_item` (
  `id` int(11) NOT NULL,
  `order_id` int(11) NOT NULL,
  `good_id` int(11) NOT NULL,
  `quantity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `provider`
--

CREATE TABLE `provider` (
  `id` int(10) UNSIGNED NOT NULL,
  `name` varchar(254) NOT NULL,
  `address` varchar(254) NOT NULL,
  `profit_in_percent` decimal(10,0) NOT NULL,
  `user_id` int(11) NOT NULL,
  `city_id` int(11) NOT NULL,
  `slug` varchar(254) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `provider`
--

INSERT INTO `provider` (`id`, `name`, `address`, `profit_in_percent`, `user_id`, `city_id`, `slug`) VALUES
(1, 'денис', 'белгород', '20', 0, 0, 'asgd'),
(2, 'serega', 'voronezh', '15', 0, 0, 'sagdasdghf'),
(3, 'stas', 'oskol', '5', 0, 0, 'asgdh'),
(4, 'asdgfhg', 'sgrdhtfjhg', '10', 11, 997, 'asdgfhg');

-- --------------------------------------------------------

--
-- Структура таблицы `regions`
--

CREATE TABLE `regions` (
  `id` int(11) NOT NULL,
  `name` int(11) NOT NULL,
  `code` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(11) NOT NULL,
  `username` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `auth_key` varchar(32) COLLATE utf8_unicode_ci NOT NULL,
  `password_hash` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `password_reset_token` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `email` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `status` smallint(6) NOT NULL DEFAULT 10,
  `created_at` int(11) NOT NULL,
  `updated_at` int(11) NOT NULL,
  `verification_token` varchar(255) COLLATE utf8_unicode_ci DEFAULT NULL,
  `fio` varchar(254) COLLATE utf8_unicode_ci NOT NULL,
  `address` int(254) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `username`, `auth_key`, `password_hash`, `password_reset_token`, `email`, `status`, `created_at`, `updated_at`, `verification_token`, `fio`, `address`) VALUES
(1, 'admin', 'lIpbfz6ULuIlYZ5W4STOO7Bk5j_vs1Ji', '$2y$13$afHsQCidUPkz41h.nhRv6OlPOaBjGH9uze2.6cjy5qY3Q2y6gMWA6', NULL, 'max-r2010@mail.ru', 1, 1619031808, 1619286578, 'tYIemtvmCS1pwKnrl9KmTgx2ygQehLhJ_1619031808', '', 0),
(2, 'okinava@afwq.afwsafsgdf', 'l59iHO-ze36hcsXRleMEff38Thwg8qe9', '$2y$13$z5V6GLerSooITVDB9htJCOfZIAxU8FCMWpNWrJUzEtdg1hQqqSOg6', NULL, 'okinava@afwq.afwsafsgdf', 9, 1619287136, 1619287136, 'vHQruZllZgfj_ckZzHx4-ILpZYtMpKKT_1619287136', 'okinava@afwq.afwsafsgdf', 308000),
(3, 'admin@admin.adminafsgdfghj', '6RzPKkId9_XmK0gTDwIBtW3MJsihuaJR', '$2y$13$IaQXsLjqXEa7oEC8o9QpE.BnlBnVDxzosM1V7r/UJkTNIQokBK5Lq', NULL, 'admin@admin.adminafsgdfghj', 9, 1619287228, 1619287228, 'dG4Y1DBhxgtAaPhTXYmv2KvAAWsGLnGu_1619287228', 'admin@admin.adminafsgdfghj', NULL),
(4, 'max-r2010@mail.ru132e3grtnyhmj', 'JOgm0raXzSptg_Dp7bd83eeS9vMQ8g4k', '$2y$13$RtzDpulzaLfll6WifDzX5erai4oiELv5tcwfeRg.MMdEAzbboWksa', NULL, 'max-r2010@mail.ru132e3grtnyhmj', 9, 1619287287, 1619287287, 'uVtd1qWQmI1uIUuup1sDFZeBzZV2b4qX_1619287287', 'max-r2010@mail.ru132e3grtnyhmj', NULL),
(5, 'admin@admin.admin1waesrd', 'U8YYj0jSacI_ugUYfo8O3x5hoyThrJV6', '$2y$13$NT06ZHDN9rq7PMtopnH58uryx.7dOFBtIi0CYOeSIBCf.uWVP7ROq', NULL, 'admin@admin.admin1waesrd', 9, 1619287442, 1619287442, 'mOp25hdZzAqACiBa8-dt2pNLDjBSJB0j_1619287442', 'admin@admin.admin1waesrd', NULL),
(6, 'okinava@afwq.afws2134ert', 'xiuXmFQQtxACEmmf2snAHs1sR0FtmRJx', '$2y$13$HAjWggVoc/G/eKcHHdT/xOJ.nuQJJDknGvCgRUk3zAXuXEPNiPyJq', NULL, 'okinava@afwq.afws2134ert', 9, 1619287537, 1619287537, '7a_klSNNdDbqYIQgwQ18AQwcPqxMheCt_1619287537', 'okinava@afwq.afws2134ert', NULL),
(7, 'admin@admin.admin1awesrd', 'R4L5JTxXd8b_zl95zQKpHaWY7dW3rWg3', '$2y$13$eBHnYxVIXPgagRHVWlId5eFUDMb7XksyA8IXEmizHfpTuSbwyjadq', NULL, 'admin@admin.admin1awesrd', 9, 1619287720, 1619287720, 'BPwscYuN0fb3i60vZFwrLXUNSEQG0JMm_1619287720', 'admin@admin.admin1awesrd', NULL),
(8, 'admin@admin.admin1awesrdsad', 'QuJicAMPtriBi4_AVnt2q29Bxt9C3cKj', '$2y$13$OE1IPPrfgG9ZCgr6e5mglOxF1SyM3cpn1FMCm8gqAYsaM5EyfXdfm', NULL, 'admin@admin.admin1awesrdsad', 10, 1619287786, 1619287786, '2GGeL07kmAafoWaAYXWJZG0rIP4juUYe_1619287786', 'admin@admin.admin1awesrdsad', NULL),
(9, 'waegsrh@waegsr.wafs', 'bBU1BI7QQ4BOZmtXCAFNnN_X2_1o92Sd', '$2y$13$Th1TqqTMbBoIbcowqDaSlO4fA9GDIFT0Uf1ecVP.CKaC9t16rQbQO', NULL, 'waegsrh@waegsr.wafs', 2, 1619287972, 1619287972, 'qDOC4soQjTFQTjO6veQlJzBN7MMFpMwR_1619287972', 'waegsrh@waegsr.wafs', NULL),
(10, 'waegsrh@waegsr.wafs2q', '8jTM_02FWGqqg-E8vSg5BU2RgN67hFNz', '$2y$13$VW1VLuh7hOPi6n5QK0jZZukOo/qzoky6RNCkG9tbOPXYG8N6T0NbC', NULL, 'waegsrh@waegsr.wafs2q', 2, 1619287995, 1619287995, 'fCPBRLXkM4NzQYtorXd1IZ1vNjXgLkbk_1619287995', 'waegsrh@waegsr.wafs2q', NULL),
(11, 'max-r2010@mail.ruwaesrd', 'C-E0sxmWyHgFCKCygRa5iAwD3ssZpKb-', '$2y$13$6mrs1SEq.F/wIVHvNBM55OHHf4AtsMaYG26PNv3On4CqS9rD4X9BK', NULL, 'max-r2010@mail.ruwaesrd', 2, 1619892809, 1619892809, 'V9SnIynaaNuGDrTfNv7v7OczMT6jxTKQ_1619892809', 'max-r2010@mail.ruwaesrd', NULL);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `article`
--
ALTER TABLE `article`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `cart_items`
--
ALTER TABLE `cart_items`
  ADD PRIMARY KEY (`user_id`,`product_id`),
  ADD KEY `idx-cart_items-user_id` (`user_id`),
  ADD KEY `idx-cart_items-product_id` (`product_id`);

--
-- Индексы таблицы `category`
--
ALTER TABLE `category`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `name` (`name`);

--
-- Индексы таблицы `city`
--
ALTER TABLE `city`
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `good`
--
ALTER TABLE `good`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `hash` (`hash`);

--
-- Индексы таблицы `migration`
--
ALTER TABLE `migration`
  ADD PRIMARY KEY (`version`);

--
-- Индексы таблицы `order_checkout`
--
ALTER TABLE `order_checkout`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `order_item`
--
ALTER TABLE `order_item`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `provider`
--
ALTER TABLE `provider`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `regions`
--
ALTER TABLE `regions`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `username` (`username`),
  ADD UNIQUE KEY `email` (`email`),
  ADD UNIQUE KEY `password_reset_token` (`password_reset_token`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `article`
--
ALTER TABLE `article`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `category`
--
ALTER TABLE `category`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;

--
-- AUTO_INCREMENT для таблицы `city`
--
ALTER TABLE `city`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1084;

--
-- AUTO_INCREMENT для таблицы `good`
--
ALTER TABLE `good`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=32;

--
-- AUTO_INCREMENT для таблицы `order_checkout`
--
ALTER TABLE `order_checkout`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT для таблицы `order_item`
--
ALTER TABLE `order_item`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `provider`
--
ALTER TABLE `provider`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `regions`
--
ALTER TABLE `regions`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
